[
    {
        "hnuser": "grantmuller",
        "date": "2024-07-08T22:39:26",
        "comment": "At Irth Solutions we build software that improve resilience and reduce risk to critical infrastructure that millions of people and businesses rely on each day. Our systems handle millions of requests a day, coordinating activities between critical infrastructure providers, contract locators, excavators, and a variety of other stakeholders throughout North America.\nWe’re growing our team and are in immediate need for a Senior Software Engineer. Here are some notes on the technical requirements:\n* C# development experience using .NET Core, WebAPI, and Entity Framework\n* Experience building browser applications using Angular and Typescript\n* Strong relational database experience with Postgres (preferred) or MS SQL Server including SQL, database functions, indexing, and performance tuning\n* Kubernetes, Docker, Linux\nApply here: https://apply.workable.com/irth-solutions/j/33AD66BA3A/\nWe’re growing, so new positions will open up frequently. Please check back with if this one doesn’t fit your background\nreply"
    },
    {
        "hnuser": "johnmoberg",
        "date": "2024-07-08T20:18:37",
        "comment": "Tandem Health | Software Engineers | On-site in Stockholm, Sweden | Full time\nAt Tandem Health we're building a clinician copilot to allow clinicians to focus on care rather than administration. We’re building, launching and iterating quickly, already at $300k ARR (+35% MoM) with over 50 care providers using the product every day. With our target set at the ginormous European healthcare market.\nWe’ve recently raised a large seed round and are expanding our Stockholm team with exceptional engineers! Our tech stack is mostly Python and TypeScript/React running on k8s in Azure.\nMore info: https://tandemhealth.ai or https://tandem-health.notion.site/Tandem-Health-Careers-f066...\nFeel free to reach out to john.moberg@tandemhealth.se if you have any questions.\nreply"
    },
    {
        "hnuser": "jdmcd",
        "date": "2024-07-08T18:18:04",
        "comment": "Rubie | Founding engineer | New York City | Full time | Onsite\nRubie is helping companies with complex software (ERPs, CRMs, etc) launch with their customers faster. We do this by automating the highly repetitive manual tasks that professional services and customer success teams perform using novel agentic infrastructure. This results in a massively faster customer implementation cycle - in the case of one of our partners, 70% faster!\nWe are hiring founding engineers in person in NYC. The first step in our process is completing our reverse engineering challenge, which is located here: https://ReverseEngineerThisSite.com\nreply"
    },
    {
        "hnuser": "mcg145",
        "date": "2024-07-08T18:52:28",
        "comment": "MongoDB-- we're looking for an experienced Java developer who has expertise in building applications with Hibernate ORM (even better if you are familiar with hibernate-ogm) to help build a Hibernate integration with MongoDB. High priority + impact + high visibility role!\nFully REMOTE (global) | Software Engineer, Java (Database Experience Team) | Full-Time | Base + RSU's | Interested? More info + apply here: https://grnh.se/e29caf031us\nreply"
    },
    {
        "hnuser": "calebralphs",
        "date": "2024-07-08T14:56:03",
        "comment": "VALIS Insights | Full-time | REMOTE (US)\nI'm the co-founder and CTO of VALIS, a B2B SaaS company delivering software solutions to the metals recycling industry. Our goal is to reduce global carbon emissions through maximizing the recovery of metals through recycling, which requires a fraction of the energy compared to mining and primary metals production. We're a seed-stage startup, backed by leading climate-tech VC's.\nProduct-wise, we integrate recycling processes, equipment/sensors, production, and procurement/sales data to deliver an insights platform that helps metals recovery facilities optimize their processes. We employ a strong, domain-driven design approach to building our product. We're looking for execution-focused engineers to join our team and deliver complex features with autonomy.\nWe're currently hiring for two roles:\nSenior Backend Engineer - https://apply.workable.com/valis-insights-1/j/4745C9DC32/\nFull-Stack Engineer - https://apply.workable.com/valis-insights-1/j/3A06E4C40A/\nPlease reach out to me at caleb.ralphs@valisinsights.com and apply if you're interested.\nreply"
    },
    {
        "hnuser": "LaurenDuolingo",
        "date": "2024-07-08T15:31:10",
        "comment": "Duolingo | Multiple Roles | Hybrid | Pittsburgh/Seattle/NYC | Full-time | $148,800-$274,600 + equity/benefits\nHere at Duolingo, we are passionate about educating our users, making fact-based decisions, and finding innovative solutions to complex problems. We offer meaningful work, limitless learning opportunities, and collaboration with world-class minds. Come brighten your life and over half a billion more!\nHighlighted Roles:\nDatabase Reliability Engineer (PGH)\nPlatform Engineer (PGH)\nSenior Mobile Engineers, iOS and Android (PGH, NYC, Seattle)\nSenior Backend Engineers (PGH)\nEngineering Leadership, Manager or Director (PGH)\nSenior/Staff Data Scientists, Economics (PGH or NYC)\nFor more details, you can view/apply to all current openings here: https://grnh.se/41f1af102us\n            ,     ,\n            )\\___/(\n           {(@)v(@)}\n            {|~~~|}\n            {/^^^\\}\n             `m-m`\nreply"
    },
    {
        "hnuser": "HardBoiled800",
        "date": "2024-07-08T18:48:17",
        "comment": "Hey Lauren! Will Duolingo be posting any new grad / junior roles soon?\nreply"
    },
    {
        "hnuser": "i_like_pie1",
        "date": "2024-07-08T18:32:33",
        "comment": "Gattaca | Founding Engineer | NYC (in-person) | Full-time | https://trygattaca.com/\nWhat we do: build agentic services to increase output of engineering teams, starting by solving client tests on mobile\nResults 3 months in: (1) $MRR growing XXX% m/o/m and (2) built v0.1 tech and early cold outreach\nWhy worth joining now: (1) few things in life are as special as doing meaningful work with great people and (2) opportunity to 10x your growth curve\nSearching for an A+ developer/teammate. We do not care about stack, education, age, location, or past titles. All that matters is your heart and whether you can ship faster than us.\nWhat you can expect from us: (1) motivated teammates; we are all-in, (2) ~2x higher $/equity then SV standard for pre-seed, (3) freedom and trust\nTo apply email founders@trygattaca.com\nMore on the role: https://tinyurl.com/yrr8fdwf\nMore on us: https://tinyurl.com/4f57haj3\nreply"
    },
    {
        "hnuser": "userm0d",
        "date": "2024-07-08T14:05:12",
        "comment": "Parakey | Gothenburg or Stockholm, Sweden | Full time | Hybrid\nWe are a growing company aiming to shake up the access industry. Forget keys and fobs; we provide access solutions where customers unlock with their smartphones. As we gain more customers, we need to expand our team with another Fullstack Developer! You will play a crucial role in advancing our product.\nAt Parakey, you will help create the access solutions of tomorrow! Your main task will be to work on the backend for our apps and API customers while continuing to develop the user interface with your skilled colleagues. You will be an important part of our success and part of a supportive team that values well-being and minimizes stress.\nLooking for:\n  - Experienced with Typescript/Javascript (React.js)\n  - Comfortable with backend (Node.js and MongoDB)\n  - Preferably experienced with Cloud/AWS, continuous integration/deployment, and other programming languages\nhttps://join.parakey.co/\nreply"
    },
    {
        "hnuser": "jacekant",
        "date": "2024-07-08T14:12:05",
        "comment": "Talpasolutions GmbH | Engineering Team Lead | Essen, Germany | Onsite or Hybrid | Full-time\nThe Full-Stack Development Team Lead will work closely with various teams to build sophisticated web applications, understanding customer needs and ensuring TALPA products add value. They will oversee the full development cycle, from strategic planning to roll-out, while crafting quality code and mentoring the team. Staying updated with the latest trends will ensure a sustainable web architecture and technology stack. The candidate needs proven experience in building scalable full-stack systems and leading a development team. Familiarity with our tech stack (Typescript with Vue.js, Node.js plus GraphQL, Docker/Kubernetes and Git) is required, along with an agile mindset and focus on long-term quality goals.\nMore information can be found here: https://jobs.ashbyhq.com/talpasolutions.com\nreply"
    },
    {
        "hnuser": "jjwarmerdam",
        "date": "2024-07-01T15:44:52",
        "comment": "Make Waves | https://makewaves.fm | Lead developer & Marketing Manager | FULLTIME | ONSITE / HYBRID (>= one day in the office a week) | Amsterdam, NL\nMake Waves was founded in 2021 by two brothers with a track record in the music and tech industry. We’re building a kinder, more helpful platform for independent artists to release their music and build a following. By providing artists with easy-to-understand tools and insights in a notoriously over-complicated industry, we want to empower DIY artists to control their careers without making concessions.\nIn the last years we’ve built the platform from the ground up and are now entering a phase where we’re focusing on growth and maturity. We’ve also secured funding for the next three to four years, so we can provide a stable job with great growth potential.\nWe are actively looking for a lead developer (with a hope you can transition into a CTO role in the near future) and a marketing manager. Unfortunately we can’t offer relocation or visa sponsorship and are only considering candidates that are able to join us in the office weekly.\nCheck out https://kb.makewaves.fm/general/careers for more details.\nreply"
    },
    {
        "hnuser": "estomagordo",
        "date": "2024-07-02T08:21:45",
        "comment": "\"competitive salary\" can mean very different things to different companies in the Amsterdam area.\nI wonder what the situation is like here. But given that the lead dev role looks to be on a CTO path, I assume compensation might be heavier in equity?\nreply"
    },
    {
        "hnuser": "davedx",
        "date": "2024-07-02T12:54:20",
        "comment": "In recent years due to the somewhat mixed economy, \"competitive salary\" in the Netherlands is typically in the 50-70k/year range in my experience (for mid/senior engineers). Salaries and freelance rates have been quite depressed in the last year or two.\nreply"
    },
    {
        "hnuser": "estomagordo",
        "date": "2024-07-02T13:24:40",
        "comment": "Kinda depressing if that is commonly accepted as competitive.\nreply"
    },
    {
        "hnuser": "davedx",
        "date": "2024-07-03T06:41:41",
        "comment": "Well it is competitive with other salaries in the Netherlands. If you don't have a family or want to buy a house then you can live reasonably well here on such a salary. If you have a family or are trying to buy a house though, it can be quite challenging. Median salary for everyone is lower still of course...\nreply"
    },
    {
        "hnuser": "alandarev",
        "date": "2024-07-05T13:32:57",
        "comment": "indeed, why anyone would want to be able to buy a house when getting paid a median salary of a professional full-time employee.\nreply"
    },
    {
        "hnuser": "azthecx",
        "date": "2024-07-02T22:29:43",
        "comment": "Anecdotally when I moved to the Netherlands I was making 50k and over two years later 70k at that same company with about 4 years of experience. If you look at talent.io tech report and other resources the median tech salary seems to be closer to 60k (70k Amsterdam) for all experience levels, all categories, so with some looking around you can find much better than that.\nreply"
    },
    {
        "hnuser": "mciancia",
        "date": "2024-07-03T10:35:16",
        "comment": "Damn, I don't think this is considered competitive in Poland, and that's even before taking taxes and CoL under account\nreply"
    },
    {
        "hnuser": "wafisher",
        "date": "2024-07-01T20:29:09",
        "comment": "MTA (... trains and buses) | Full-time | NYC | 3x/week in office (onsite)\nWe're hiring one product manager and one software engineer.\nOur team works on all the (non-ad) screens in the subway, as well as two apps (TrainTime and the MTA app) and our website. We're a team of 20, mostly engineers, a few PMs and a designer. We operate like a startup within the MTA and are responsible for all customer-facing digital endpoints.\nSee one of our products here: https://apps.apple.com/us/app/mta-traintime/id1104885987\nwfisher [at] mtahq [dot] org\nreply"
    },
    {
        "hnuser": "plondon514",
        "date": "2024-07-02T11:10:51",
        "comment": "Thank you to the work you and everyone else at the MTA does!\nreply"
    },
    {
        "hnuser": "mraza007",
        "date": "2024-07-04T06:36:11",
        "comment": "What tech stack are you guys using?\nIf you don’t mind me asking\nreply"
    },
    {
        "hnuser": "PanMan",
        "date": "2024-07-01T15:07:24",
        "comment": "Quatt.io | Amsterdam, Netherlands | Full-time | Hybrid/ONSITE | https://quatt.io | climate tech\nI'm head of Software at Quatt, a quickly growing startup/scaleup building heatpumps to help fix climate change. Heating and cooling is 50% of all energy used in the EU. Heat pumps save 10 times more CO2 for each Euro spent on them compared to electric cars. We're building the most accessible and smartest heatpump on the market. Our product is live, we have thousands of customers, tons of data, and I really like the impact we're having. I'm currently looking for a few roles for my department, as we believe having the best software will allow us to have the best product. Our backend and frontend is Typescript.\n  * Medior QA / Test automation engineer\n  * Senior app developer (React native)\n  * Senior Backend developer (Typescript)\n  * Medior Full-stack developer (Typescript)\n  * DevOps Engineer\nNow is a great time to join, as the software team is still small but growing quickly. These and other vacancies are on our careers page: https://www.quatt.io/working-at-quatt Email me directly ( my-hacker-news-username@quatt.io ) for questions or apply via the career page. Unfortunately, at this time, you have to be allowed to work in the EU: we're not able to sponsor Visa\nreply"
    },
    {
        "hnuser": "lukan",
        "date": "2024-07-01T15:30:17",
        "comment": "\"Hybrid/ONSITE\"\nWhat exactly does that mean? Part time remote from within the EU is possible, with regulary travelling there, or does it mean, some days of the week remote is possible but otherwise office time is required (and therefore relocating)?\nreply"
    },
    {
        "hnuser": "PanMan",
        "date": "2024-07-01T18:01:10",
        "comment": "It depends a bit on the role, we're considering more remote options, but for now we mostly hire people that are in the office part of the week.\nreply"
    },
    {
        "hnuser": "thecollins",
        "date": "2024-07-02T01:27:42",
        "comment": "Antithesis | Software Engineers, ML Research Scientists | Northern VA | ONSITE | https://antithesis.com/\nAntithesis is using deterministic simulation, fuzzing, and novel ML techniques to improve software testing and increase developer velocity. For an idea of what we're doing, see Will's talk here: https://www.youtube.com/watch?v=fFSPwJFXVlw or read the Simulation Testing section of https://www.foundationdb.org/files/fdb-paper.pdf. Fully funded medical, dental, and vision insurance. Unlimited vacation (with mandatory MINIMUM vacation time). Flexible hours. Incredible, cohesive team with the hardest and most interesting problems to solve.\nWe're doing things nobody has done before, so we don't need familiarity with any particular language, framework, domain, or anything like that. Don't care. What we do care about: you're smart, get things done, a joy to work with, and are comfortable dealing with open-ended problems.\nApply at https://antithesis.breezy.hr/ (Don't worry too much about which role you choose. We're looking for engineers who are ready to learn, not those that know everything already!)\nWe're also hiring for professional services roles. Feel free to ask about those.\nreply"
    },
    {
        "hnuser": "vb234",
        "date": "2024-07-02T01:51:02",
        "comment": "This looks super interesting. I’m interested in the professional services position but definitely can’t relocate to Vienna at this time. Is that absolutely required?\nreply"
    },
    {
        "hnuser": "terpimost",
        "date": "2024-07-02T11:13:12",
        "comment": "Yes\nreply"
    },
    {
        "hnuser": "lakunle",
        "date": "2024-07-02T20:17:43",
        "comment": "hello, Is visa sponsorship available for the Senior Software Engineer role?\nreply"
    },
    {
        "hnuser": "adog91",
        "date": "2024-07-02T03:56:59",
        "comment": "Hi are you open to hiring for new grad or fall 2024 co-op roles for SWE?\nreply"
    },
    {
        "hnuser": "visviva",
        "date": "2024-07-01T15:50:33",
        "comment": "Umbra | Multiple roles | Onsite & Hybrid (Santa Barbara, Austin, Washington DC) | https://umbra.space/\nUmbra builds next-generation space systems that observe the Earth in unprecedented fidelity. Our mission: Deliver global omniscience.\nTo stay ahead of climate change, geopolitical risk, and other major crises, we need a global understanding of what is changing, where, and how fast. Umbra is built around the idea that by providing easy access to the highest quality commercial satellite data available, we can become an indispensable tool for the growing number of organizations monitoring the Earth. We empower our customers with the ability to create the solutions that inform, inspire, and address our planet’s most pressing needs. We’re helping to create a brand new industry that has never meaningfully existed before. To make our vision a reality, we're gonna need some help.\nWe're looking to fill a variety of mid- to senior-level roles, including openings in Spacecraft Operations, Mission Systems Architecture, Embedded Software Engineering, and Corporate Counsel. If you're interested in helping us build, please apply at https://umbralab.bamboohr.com/careers\nreply"
    },
    {
        "hnuser": "vk_energie",
        "date": "2024-07-08T14:06:13",
        "comment": "VK Energie GmbH | IT-Infrastructure/DevOps Engineer | Munich, Germany | Onsite or Hybrid | Full- or Part-time\nWe are looking for a motivated expert to join our development team and support us in developing and shaping our growing IT infrastructure. You can contribute and implement your own ideas and suggestions, both conceptually and in the selection of tools. In addition to a high level of personal responsibility and a broad field of application, we offer you a working environment where quality and sustainability are valued more than quick solutions.\nYour Skills and Experience: Experience with Infrastructure as Code (Ansible, Terraform) Automation/Orchestration experience (Docker, GitLab CI) Ideally, skills in Python/Go, data pipeline experience, and experience with software projects Experience with cloud providers (ideally Microsoft Azure) Linux and network administration skills German level B2 and up\nWhat You Can Expect: A team consisting of energy transition enthusiasts, detail-oriented engineers, and brilliant tech freaks, as well as a company culture that prioritizes its employees!\nIf we have sparked your interest, please send your application or any questions to Jana at karriere@vk-energie.de. We are looking forward to meeting you!\nMore about us: https://www.vk-energie.de/\nreply"
    },
    {
        "hnuser": "ilong",
        "date": "2024-07-08T13:29:49",
        "comment": "Salable (part of The Adaptavist Group)| Technical Product Marketing Manager | Fulltime | Remote UK or Spain\nSalable - a brand under The Adaptavist Group, that simplifies the monetisation and licensing of SaaS products. https://www.salable.app/\nThe Adaptavist Group - a rapidly growing tech company with over 1,000+ employees and a great culture (4.8 on Glassdoor). We are global triple platinum partners to Atlassian and partner with some of the world’s most trusted technology ecosystems, including Atlassian, AWS, Slack, GitLab, Monday.com and many more. https://www.theadaptavistgroup.com/\nThe role - Technical Product Marketing Manager Remote UK: https://jobs.lever.co/adaptavist/73e2f980-a432-4413-a2bf-f4d... Remote Spain: https://jobs.lever.co/adaptavist/f9f311f5-744d-4765-b565-0a5...\nreply"
    },
    {
        "hnuser": "richardzyx",
        "date": "2024-07-02T00:52:37",
        "comment": "Electric Hydrogen | eh2.com | Staff Data Engineer, Senior Data Engineer | San Carlos, CA; Natick, MA; or Hybrid Remote | Full-time | Visa\nElectric Hydrogen builds the world's most powerful electrolyzer at 100MW using modular & integrated design to radically lower the cost of green hydrogen production and increase global adoption. We just raised $380M in Series C financing, claiming the title of the first $1B green hydrogen start-up as recently covered by WSJ and TechCrunch.\nThe digital team works on everything from R&D to manufacturing and field services. Our 100MW plant has thousands of sensors sampling at 1hz - 5khz or more, requiring robust data processing, visualization, analytics & data science infrastructure. We deploy to some of the most remote regions on the planet with a product that needs to work reliably for decades, creating a unique challenge for networking, data ingestion & software development. Moreover, our Gigafactory and R&D labs are constantly collecting data for continuous improvements & scientific discoveries, all requiring different features & architecture to support and scale.\nBenefits include competitive salary, ISO, 401K with match, and more.\n- Staff or Senior Data Engineer: https://eh2.com/careers/?gh_jid=4332005005\nWe have offices in Natick/Boston, Devens, MA, San Carlos & San Jose and support hybrid remote & relocation. If interested, please reach out to me: rzhang at eh2.com\nreply"
    },
    {
        "hnuser": "rattray",
        "date": "2024-07-02T01:27:05",
        "comment": "Stainless | Generalist Engineers, First AE | NYC ONSITE | Full-time\nStainless is building the platform for high-quality, easy-to-use APIs. Our first product is SDKs as a service.\nWhen you `npm install openai` or `pip install anthropic` or `go get …cloudflare`, for example, you’re downloading code that we generated. (I built the codegen system at Stripe for their SDKs, and am now building a better version for everyone.)\nNext, we want to make it easy to build amazing REST APIs. REST is simple and ubiquitous, but right now it’s also messy, chaotic, and hard to get right. We’re going to build great open-source standards and tooling that bring the benefits of GraphQL (types, field selection/expansion, standards) and gRPC (types, speed, versioning) to REST.\nWe’re ~2y old, ~10 people, have strong revenue (could choose to be profitable), and great customers (including OpenAI, Anthropic, and Cloudflare). We’re backed by Sequoia.\nAs one of our first ten engineers, you’ll get autonomy to build great products, skilled peers, opportunity for tremendous impact, competitive salary, and a very competitive ownership stake.\nWe’re looking for exceptionally productive, thoughtful, tasteful, and kind people with a passion for making software development better for everyone.\nWant to build the future of API tooling? Say hi: alex at stainlessapi.com\nreply"
    },
    {
        "hnuser": "iliketrains",
        "date": "2024-07-01T16:59:17",
        "comment": "MaFi Games | Senior SWE/game dev | Contract or full-time | $70-110k | Remote | C#\nI’m the co-founder of MaFi Games – an indie studio behind the game Captain of Industry. We are a small but passionate team who gave up their jobs at Google/Nvidia to pursue building the best factory simulation game possible, and we need more hands!\nWe are looking for an experienced software engineer to grow the team and accelerate our progress. We strongly prefer candidates with a background in game development or with experience in desktop UI, 3D graphics, and performance optimizations.\nSome reasons you’d enjoy working with us:\n* A multicultural, collaborative, and innovative work environment where your voice is heard.\n* Fully remote job with flexible working hours and vacation schedule.\n* High quality C# code base, code reviews, tests.\n* High work satisfaction, work on a popular video game with a wonderful community.\nAs an example of our technical work see https://www.captain-of-industry.com/post/cd-31.\nIf interested, please see the detailed info and requirements at https://www.captain-of-industry.com/jobs, thanks!\nNote that this is a fully remote job and we are happy to consider candidates from any country around the world!\nreply"
    },
    {
        "hnuser": "smiletondi",
        "date": "2024-07-02T07:16:20",
        "comment": "Hi,\nI'm currently exploring game development and would love to contribute to your team as an intern. Although I have no prior experience in game development, I bring over five years of experience as a FullStack JavaScript Developer, with strong skills in UI/UX design and a passion for learning new technologies.\nCould you please let me know if there are any internship opportunities available? I am very interested in MaFi Games.\nThank you for considering my request.\nreply"
    },
    {
        "hnuser": "storyinmemo",
        "date": "2024-07-01T19:14:38",
        "comment": "Been playing since very early release and love this amazing game.\nreply"
    },
    {
        "hnuser": "Arch485",
        "date": "2024-07-02T00:27:07",
        "comment": "Applied! What y'all do sounds really interesting and I hope to hear back :)\nreply"
    },
    {
        "hnuser": "brianr",
        "date": "2024-07-01T15:39:03",
        "comment": "Rollbar | https://rollbar.com | Remote Europe, Budapest | Engineering\nAbout Rollbar:\n* We're a ~30-person team (SF, Budapest, remote US and Europe) with a mission to help developers build software quickly and painlessly\n* We help tens of thousands of developers find and fix errors faster.\n* Our backend handles billions of errors with low latency and high reliability\n* Our front-end allows developers to discover and drill down across millions of errors in real-time\n* Our customers are some of the best engineering teams in the world, including Twilio and Shipt\n* Our values are honesty, transparency, pragmatism, and dependability\n* Our tech stack includes Python, Node.js, TypeScript, and React; MySQL, Kafka, ClickHouse, Elasticsearch, and Redis; Kubernetes, Terraform, and Google Cloud Platform.\nWe're currently hiring for:\n- Senior Software Engineer, Full-stack (Europe)\nPlease apply via: https://rollbar.com/careers/\nreply"
    },
    {
        "hnuser": "seriousmofo",
        "date": "2024-07-08T03:49:20",
        "comment": "WorkBright is hiring a Platform Support Engineer\nhttps://workbright.com/\nCompany is Colorado based and the job is REMOTE (US).\nWorkBright is a leading HR platform for onboarding, remote verification and the best Form I-9 solution in the world. We empower folks to get to work and streamline the hiring process. Our product catalog includes Onboarding, an ATS, and a series of integrations.\nIt's a great place to work with a human-first approach to work.\nThe Platform Support Engineer is responsible for investigating bug reports and other issues with the rails backend and Vue fronted, and a few important integrations.\nThe company is still small (40-50 ppl), so this role has lots opportunities for getting into areas of interest like performance tuning, AWS configuration, building internal tools, and even feature work.\nhttps://meta.workbrightats.com/jobs/1117493-50303.html\nreply"
    },
    {
        "hnuser": "seriousmofo",
        "date": "2024-07-08T16:40:53",
        "comment": "Inc best place to work! https://www.inc.com/best-workplaces/2024\nreply"
    },
    {
        "hnuser": "drice",
        "date": "2024-07-01T16:32:53",
        "comment": "Virta Health (https://virtahealth.com) | SF/Denver/REMOTE (USA Only) | Full-Time\nVirta Health is on a mission to transform diabetes care and reverse the type 2 diabetes epidemic. Current treatment approaches aren’t working—over half of US adults have either type 2 diabetes or prediabetes. Virta is changing this by helping people reverse type 2 diabetes through innovations in technology, personalized nutrition, and virtual care delivery reinvented from the ground up. We have raised over $350 million from top-tier investors, and partner with the largest health plans, employers, and government organizations to help their employees and members restore their health and live diabetes-free. Join us on our mission to reverse diabetes in 100M people.\nVirta has been named one of Time's 100 Most Influential Companies 2023 and one of Fortune's Best Workplaces in the Bay Area 2023.\nPositions are Remote-first (USA Only). Virta also has offices in San Francisco, CA and Denver, CO.\nTech stack: Typescript, React/React-Native, Python, GCP, Golang\nOpen Positions:\n- Senior Backend Engineer - Activation ($185,000 - $240,000): https://jobs.ashbyhq.com/virtahealth/1748c3a4-a0ec-4ed2-b14a...\n- VP, Insights & Analytics ($200,000 - $245,000): https://jobs.ashbyhq.com/virtahealth/98bbe78d-5994-4f13-b82f...\nreply"
    },
    {
        "hnuser": "dcsourcegraph",
        "date": "2024-07-01T21:52:18",
        "comment": "Sourcegraph | San Francisco, Remote | Full-Time | Developer, Designer who codes, EM who codes, PM who codes, Customer Eng, Dev Marketer | https://sourcegraph.com\nSourcegraph is building the code intelligence platform that powers the world's best code search and the most popular open-source AI coding plugin.\nWe aim to automate 99% of the toil of software engineering with great code understanding tools and human-guided AI code generation. The remaining 1% is the creative spark of software development and our mission is to enable every dev to focus on this, rather than the tedium that makes coding inaccessible to 99% of humans. Our core tech includes our code knowledge graph, global search index, frontier LLMs (the best proprietary and open-source models with in-house finetuning), and OpenCtx, an open protocol for technical context. Our customers range from startups to the Fortune 500. Our founders still code.\nApply here: https://grnh.se/0572f98b4us\nreply"
    },
    {
        "hnuser": "dbenamy",
        "date": "2024-07-01T17:17:53",
        "comment": "Datadog | Software Engineers | ONSITE (Boston, Lisbon, Madrid, NYC, Paris, Tel Aviv) | Full-time\nDatadog is a monitoring, tracing, logs system, and more, for your infrastructure and services. We build our own tsdb, event store [1][2], distributed tracing tools, cutting edge visualizations, and more. We love shipping great experiences for customers just like us and are growing fast! We write a lot of Go, Java, Python, Typescript (with React), and a bit of other languages. We run on k8s, and are multi-region and multi-cloud.\nWe're looking for people who can build systems at scale as we process trillions of events per day. Let us know if that's you!\nhttps://dtdg.co/hnwhoshiring\n[1] https://www.datadoghq.com/blog/engineering/introducing-husky\n[2] https://www.datadoghq.com/blog/engineering/husky-deep-dive\nreply"
    },
    {
        "hnuser": "giacostart",
        "date": "2024-07-02T22:43:05",
        "comment": "Applied, anywhere I can follow up throughout the application process?\nreply"
    },
    {
        "hnuser": "occams_chainsaw",
        "date": "2024-07-02T05:35:07",
        "comment": "Any tips for what DD is looking for outside of what's mentioned explicitly?\nreply"
    },
    {
        "hnuser": "sjckciodjcr",
        "date": "2024-07-01T22:07:09",
        "comment": "Any plans to open an office in Bay Area? Would love to work at datadog\nreply"
    },
    {
        "hnuser": "angoragoats",
        "date": "2024-07-01T22:28:15",
        "comment": "Or, you know, allow remote work, which is inexcusable not to allow for a pure software company in 2024.\nreply"
    },
    {
        "hnuser": "whiplash451",
        "date": "2024-07-01T23:00:46",
        "comment": "What is their policy exactly ?\nreply"
    },
    {
        "hnuser": "slekker",
        "date": "2024-07-02T08:25:26",
        "comment": "If you joined while they were remote, you may stay so, but otherwise they are pushing for people to go back to the office. I guess they invested too much in real estate.\nreply"
    },
    {
        "hnuser": "angoragoats",
        "date": "2024-07-01T23:39:28",
        "comment": "I’m commenting based on the grandparent post, which says ONSITE clearly at the top.\nreply"
    },
    {
        "hnuser": "dbenamy",
        "date": "2024-07-01T23:29:05",
        "comment": "Afaik we’re not really hiring there atm.\nreply"
    },
    {
        "hnuser": "Aditya198",
        "date": "2024-07-02T03:25:35",
        "comment": "do you sponsor Visa for EU locations?\nreply"
    },
    {
        "hnuser": "bill_duckduckgo",
        "date": "2024-07-01T15:25:14",
        "comment": "DuckDuckGo | Multiple Roles | Remote | Full-time | $176k-242k USD + equity\nWe are looking for candidates that are excited to join us on a mission to raise the standard of trust online. All of our roles are fully-remote, except where specific locations are noted.\nRemote Open Roles at DuckDuckGo:\nSenior C++ Engineer - $176k + equity — https://duckduckgo.recruitee.com/o/senior-cplusplus-engineer...\nEngineering Director, Apple - $242k + equity — https://duckduckgo.recruitee.com/o/engineering-director-desk...\nSenior Backend Engineer - $176k + equity — https://duckduckgo.recruitee.com/o/senior-backend-engineer-r...\nLead, Business Development (US/Canada) $198k - $220k + equity —https://duckduckgo.recruitee.com/o/lead-business-development...\nSenior Software Engineer, Windows Desktop App - $176k + equity — https://duckduckgo.recruitee.com/o/senior-windows?source=Hac...\nhttps://duckduckgo.com/hiring\nreply"
    },
    {
        "hnuser": "jomsk1e",
        "date": "2024-07-04T07:36:02",
        "comment": "Every month in the 'Who is hiring?' posts, DuckDuckGo consistently lists job openings. When you go to their hiring page it looks very interesting. You get paid on their \"Test\" projects. I am not sure if those \"Test\" projects are live actual requirements that they make applicants do, then they will eventually not hire. OR these job postings are just to maintain their visibility creating the impression of ongoing expansion without all positions necessarily being filled.\nreply"
    },
    {
        "hnuser": "bill_duckduckgo",
        "date": "2024-07-04T16:37:46",
        "comment": "Thanks for your interest in our roles and the questions you’ve raised here. Here’s a quick answer:\n— Test projects: these are not live requirements that we get people to work on. We create these test projects as a way to assess people’s skills and how well they fit with what we need for the role. We like to pay people for these as we recognize that not everyone will be successful in the process, but we still want to compensate them for their time in some way.\n—ongoing job openings: we only post job openings for roles that we’re actually hiring for at the time. We often post a single job opening for a role where we’d like to hire several people. So they can sometimes stay open for quite some time!\n—LinkedIn openings vs our career page: we post every live role we have on our own careers page, but only some of them on LinkedIn, so there can often be a difference between the live roles on both sites.\nreply"
    },
    {
        "hnuser": "qwelias",
        "date": "2024-07-01T21:29:50",
        "comment": "They say remote, but there's a hard list of supported countries at the bottom of job application form that should be at the top.\nreply"
    },
    {
        "hnuser": "aleksandarbos",
        "date": "2024-07-07T12:33:20",
        "comment": "exactly! these are the countries you can work remotely from (according to their website):\n  - United States\n  - Australia\n  - Canada\n  - Czechia\n  - Hungary\n  - Iceland\n  - Ireland\n  - Poland\n  - Slovakia\n  - Spain\n  - United Kingdom\nreply"
    },
    {
        "hnuser": "ermaknn",
        "date": "2024-07-03T09:01:12",
        "comment": "Got rejected with 13 level of experience in C++. What is the reason if you are still hiring?\nreply"
    },
    {
        "hnuser": "stirredo",
        "date": "2024-07-02T06:44:18",
        "comment": "Look at their linkedin job postings. Only Apple and C++ engineer posts are open. No other posts open.\nreply"
    },
    {
        "hnuser": "LotToLearn",
        "date": "2024-07-02T06:54:02",
        "comment": "Looks super interesting!\nreply"
    },
    {
        "hnuser": "hack_only",
        "date": "2024-07-02T02:47:55",
        "comment": ""
    },
    {
        "hnuser": "",
        "date": "2024-07-02T05:58:28",
        "comment": ""
    },
    {
        "hnuser": "",
        "date": "2024-07-02T04:37:02",
        "comment": ""
    },
    {
        "hnuser": "mousetree",
        "date": "2024-07-01T16:29:51",
        "comment": "Seen Finance | https://seen.com | Full time | Berlin, Chicago | Hybrid on-site\nAt Seen, we believe that everyone deserves a fair opportunity to (re)build their credit. We understand how tough it can be to qualify for a credit card when your credit score isn't where you want it to be.\nSeen is a new fintech company, started in 2023 following the acquisition of Sable (YC S19) by Snap Finance. We've recently launched a credit card in the US for people with less than ideal credit. We plan to offer other novel credit products in the future.\nIt's a great time to join as the team is small (15 engineers) and we're growing fast. We're a startup but we're also lucky to have the financial support and customer base from our parent company.\nWe're hiring for:\n* Senior and Staff Software Engineers (Berlin)\n* Senior and Staff Data Engineers (Chicago)\nOur mobile app, web app, and backends are written in Typescript. Our data stack uses Python and SQL.\nIf you're interested, just email us your resume or LinkedIn page: join-berlin@seen.com (for both Berlin and Chicago roles)\nreply"
    },
    {
        "hnuser": "konz",
        "date": "2024-07-01T16:13:04",
        "comment": "ML6 | Machine Learning Engineer, Data Engineer | Python, TensorFlow, PyTorch, GCP, AWS, Azure | Full-time | Amsterdam, Berlin, Ghent (EU) On-site/hybrid\nWe are a Machine Learning consulting company that builds end-to-end Machine Learning solutions. By applying the latest AI research, we keep our clients at the forefront of innovation.\nIf you are interested check out: https://www.ml6.eu/resources/resource-library and https://www.ml6.eu/client-cases\nWork on innovative projects for the biggest clients across Europe such as Randstad, ASML, FUNKE, and many more! Whether it’s about leveraging LLMs to improve customer support, building data lakes on cloud platforms to improve storage or implementing models using sensor data for quality control. You can find it all at ML6.\nYou will mostly work with Python and a range of ML frameworks such as TensorFlow, PyTorch, or HuggingFace Transformers to solve hard Machine Learning tasks and help bring these application into production by building data pipelines and cloud infrastructure on all of the major cloud providers (GCP, AWS, Azure).\nWe are looking for:\n• (Senior) Data Engineer\n• (Senior) Software Engineer\n• (Senior) Machine Learning Engineer\n• Alliance Manager – Azure\n• AI Team Lead\n• AI Client Executive\n• AI Client Partner\n• AI Project Manager\n• Talent Partner\nApply at: https://ml6.eu/join-us\nreply"
    },
    {
        "hnuser": "slimjimrick",
        "date": "2024-07-01T15:01:58",
        "comment": "Eigen | Full-Time | product engineers, ex-technical founder engineers, and ai engineers | REMOTE (all remote) | Hiring GMT-8 to GMT+2\nEigen helps companies build world-class AI products, enabled by the cutting edge of AI and LLMs. Products span spaces from edtech to leadgen to finance.\n* we are a real business — profitable with $XM in revenue this year.\n* we need: product engineers, ex-technical founders, and ai engineers to build products. Experience with typescript stacks and/or python is fantastic.\n* smart team. ex. stanford ai lab, harvard, uber, tinder, etc.\n* if you're a fullstack ts dev and are interested in growing into AI, this role is perfect for you.\n* if you like learning about new industries and working on different kinds of projects regularly, this role is perfect for you.\nsend an email to careers [at] eigen (.) net with a resume/site link/whatever is indicative of you. No need to write long email, just a \"hi\" is great :)\nreply"
    },
    {
        "hnuser": "grimre4p",
        "date": "2024-07-08T11:44:25",
        "comment": "u-blox | IT Digital Customer Experience Manager | Cambourne | Onsite | 65,000 - 75,000 GBP / year | Full-Time\nTech used: CRM, ERP, Support, JavaScript, PHP, SAP, Salesforce, Security\nu-blox (SIX:UBXN) is a global technology leader in positioning and wireless communication in automotive, industrial, and consumer markets. Smart and reliable solutions, services, and products from u-blox let people, vehicles, and machines determine their precise position and communicate wirelessly over cellular and short range networks.\nMore details and option to apply: https://devitjobs.uk/jobs/u-blox-IT-Digital-Customer-Experie...\nreply"
    },
    {
        "hnuser": "carterschonwald",
        "date": "2024-07-08T11:49:01",
        "comment": "Your gps hardware is super cool, and wonderfully written datasheets too\nreply"
    },
    {
        "hnuser": "Freeformcareers",
        "date": "2024-07-04T00:06:18",
        "comment": "Freeform (freeform.co) | Software Engineers (C++ / Rust) | Sr DevOps/Linux Engineer | Full-time | Onsite | Los Angeles, CA\nAt Freeform, our mission is to deploy autonomous factories worldwide, much like AWS's network of data centers. By harnessing the latest in real-time hardware control, high-performance computing, computer vision, and machine learning, we're bringing 3D printing to the forefront of the digital age. Join us in a dynamic, fast-paced R&D environment where you'll play a crucial role in architecting and implementing these groundbreaking solutions.\nYou’d have the opportunity to own significant and impactful greenfield projects throughout the entire development lifecycle and work alongside a sharp, tight-knit team that comes from the likes of Google, SpaceX, and Apple, and believe in taking a first principles approach to solving hard problems.\nA glimpse into our software landscape - https://vimeo.com/854855155\n+ Senior Software Engineer (C++) - https://grnh.se/ae6e953a3us\n+ Senior Software Engineer (Rust) - https://grnh.se/5785c7ca3us\n+ Software Engineer (C++) - https://grnh.se/898d54653us\n+ Software Engineer (Rust) - https://grnh.se/a03878ea3us\n+ Senior DevOps/Linux Engineer - https://grnh.se/8f44df583us\nreply"
    },
    {
        "hnuser": "DailyRecruiter",
        "date": "2024-07-05T13:56:41",
        "comment": "Loneliness is a significant health crisis, especially for older adults. We're using advanced AI to connect people through group events and shared experiences, reducing loneliness and improving quality of life. Backed by Stanford research and top investors, our platform is already making a positive impact. Join our mission-driven team to scale this solution and transform lives.\nStealth Company | San Francisco | Hybrid | Founding Engineer (Venture-Backed Founding Team) • Apply Now!: https://tinyurl.com/4zt3v98w\nreply"
    },
    {
        "hnuser": "cuchoi",
        "date": "2024-07-01T16:09:51",
        "comment": "Enveritas (YC S18, Non-Profit) | Backend Software Engineer | Remote / Global | https://enveritas.org/jobs/ Enveritas is a 501(c)3 non-profit working on sustainability issues facing coffee farmers around the globe. We provide sustainability assurance for the coffee industry. We visit smallholder coffee farms around the world to understand their social, economic, and environmental practices. In 2024, we will visit over 100,000 farms across more than 30 countries in Asia, Africa, and Latin America. We work with leading coffee roasters to understand the sustainability issues in their supply chain based on our sustainability standards.\n* Backend Software Engineer - $130-$150k — http://enveritas.org/jobs/backend-software-eng/#10d7adef8us (worldwide remote)\nreply"
    },
    {
        "hnuser": "bobthecowboy",
        "date": "2024-07-07T05:41:12",
        "comment": "I've been digging over your website; super interested and just applied.\nreply"
    },
    {
        "hnuser": "kisamoto",
        "date": "2024-07-01T16:30:54",
        "comment": "That is very cool. If I wasn't working on my own project I would applying for this (I love coffee and the journey of coffee).\nKeep up the great work.\nreply"
    },
    {
        "hnuser": "remilekun9__",
        "date": "2024-07-03T11:56:11",
        "comment": "If you want an entry level or intern to help in frontend I can help.\nlinkedin[dot]com/ in/remilekun-egwuda\nreply"
    },
    {
        "hnuser": "kevinconroy",
        "date": "2024-07-01T16:59:44",
        "comment": "I highly recommend Enveritas to anyone looking!\nreply"
    },
    {
        "hnuser": "gmreads",
        "date": "2024-07-04T16:58:25",
        "comment": "Took your suggestion and just applied. Just curious though, why the recommendation ?\nreply"
    },
    {
        "hnuser": "mertens",
        "date": "2024-07-01T17:53:48",
        "comment": "CrazyGames | https://about.crazygames.com/ | REMOTE | Full-time | Multiple roles\nWith recent technologies such as WebGPU and WebAssembly, the browser is quickly becoming a powerful gaming platform. High-quality 3D graphics and near-native level performance are becoming possible without the need for downloads, apps, or platform-specific development. Our browser games platform is already reaching more than 35 million people per month. We are self-funded, profitable, remote-first, and fast-growing.\nWe are currently looking for multiple people on the product and engineering side to bring our product to the next level.\nPlease note that we're looking for people who can work on a European timezone.\n* Product Engineer: https://crazygames.recruitee.com/o/remote-product-engineer-b\n* Data scientist: https://crazygames.recruitee.com/o/data-scientist\n* Front-end engineer: https://crazygames.recruitee.com/o/remote-senior-front-end-e...\n* Performance marketing specialist: https://crazygames.recruitee.com/o/fully-remote-ua-manager\nWe also have 1 role in Belgium specifically:\n* Software Engineer: https://crazygames.recruitee.com/o/software-engineer\nreply"
    },
    {
        "hnuser": "timgl",
        "date": "2024-07-02T12:43:45",
        "comment": "PostHog | Full-Time | product engineers and ex technical founder engineers | REMOTE (all remote) | Hiring GMT-8 to GMT+1 PostHog helps engineers build better products by combining product analytics, feature flags, session replay.\n* open source, building a dev tool. We have a public handbook (posthog.com/handbook) if you want to learn how we work, pay and more in complete detail.\n* we are a real business... at $12M ARR / profitability in sight / lots of capital / grew revenue 4x last year\n* we are growing through more autonomy and transparency not through process.\n* we have a ton of scale and a bunch of super interesting technical problems to solve\n* we're building 20 more products over the next couple of years, so you could end up building one of those\n* we need: product engineers and ex technical founders to build products posthog.com/careers\nreply"
    },
    {
        "hnuser": "Gravyness",
        "date": "2024-07-02T14:55:58",
        "comment": "What a great experience applying, thanks for that! Its organized, easy to navigate, descriptions are clear and straight to the point, it even has got a nice design! Talk about raising the bar!\nreply"
    },
    {
        "hnuser": "DylanSp",
        "date": "2024-07-05T16:34:26",
        "comment": "Seconding the praise for your application process and website, it's very well done. I applied earlier this week, and even though I got a rejection email today, I really appreciate the quick response.\nreply"
    },
    {
        "hnuser": "gcj",
        "date": "2024-07-02T22:29:16",
        "comment": "What a well done website!\nreply"
    },
    {
        "hnuser": "gcj",
        "date": "2024-07-02T22:32:10",
        "comment": "Also, even though I believe people should be paid for the quality of their work, not their location, props for at least being the most transparent as possible about it.\nreply"
    },
    {
        "hnuser": "mangoparrot",
        "date": "2024-07-02T22:45:07",
        "comment": "Open source done right.\nApplied!\nreply"
    },
    {
        "hnuser": "mojed",
        "date": "2024-07-03T08:48:14",
        "comment": "thanks for the sticker :-)\nreply"
    },
    {
        "hnuser": "Kelsey_Finnegan",
        "date": "2024-07-05T19:33:22",
        "comment": "Automox | Software Engineer- Software Agent | Remote (US)- Full time | $130K-$170K | we do not provide visa sponsorship\nLink to the job description:https://boards.greenhouse.io/automox/jobs/4039064008\nABOUT YOU • Golang programming experience is preferred however, an interest in programming with Golang is required. The right candidate will leverage their extensive engineering background to be impactful in any object oriented programming language. • 3+ years of experience designing, developing, testing, monitoring, and maintaining cloud-connected client-side applications. • Experience working as a Software Engineer developing features on an Agent/IoT application is required. • Some familiarity with systems programming, networking, virtual machine orchestration, DevOps, and shell-scripting languages (Bash/Powershell) • Windows and/or Linux and/or MacOS application development experience. Excellent communicator, thrives within a tightly knit, cross-functional remote team environment.\nIf YOU ARE INTERESTED please reach out to me on Linkedin or email (feel free to connect with me on Linkedin as well):\nKelsey Finnegan www.linkedin.com/in/kelsey-finnegan-009267167 kelsey.finnegan@automox.com\n*If you apply, let them know that you saw the post here, and still please reach out to me to let me know that you applied and it'll be easier for me to get you in front of the hiring manager and not lost in a sea of resumes :)\nreply"
    },
    {
        "hnuser": "freeqaz",
        "date": "2024-07-01T18:37:45",
        "comment": "Figma | Senior/Staff Security Engineer | Remote (US / Canada), or in-office SF/NYC | Full-time | $149k - $350k\nThe security team at Figma spans a bunch of areas (AppSec, Infra, AI/ML, etc). I am currently working on securing our recently announced AI features -- how do you deal with model security? Especially when some of those models include private data? Not a lot of prior art here, so it's an interesting learning experience!\nWe're really just looking for smart people that want to find problems to chip at. The company is growing fast and there is no shortage of interesting work. (I wrapped up my YC startup to join the team!)\nGeneric job req is here: https://boards.greenhouse.io/figma/jobs/4214880004\nFeel free to email me at fwortley at <name of company above>.com\nreply"
    },
    {
        "hnuser": "samuelklam",
        "date": "2024-07-06T01:16:45",
        "comment": "PermitFlow (YC W22) | Staff, Fullstack & Frontend Software Engineers | New York, NY | ONSITE | Full-time | https://permitflow.com\nPermitFlow’s mission is to streamline and simplify construction permitting in the $1.6 trillion United States construction market. Our software reduces time to permit, supporting permitting end-to-end including permit research, application preparation, submission, and monitoring.\nWe’ve raised a $31m Series A led by Kleiner Perkins with participation from Initialized Capital, Y Combinator, Felicis Ventures, Altos Ventures, and the founders and executives from Zillow, PlanGrid, Thumbtack, Bluebeam, Uber, Procore, and more.\nPermitting is a challenging yet interesting problem; thousands of municipalities across the United States have their own processes and requirements - many which are continually updating. Software, AI, and LLMs provide an exciting opportunity for us to reason at scale and distill a nuanced and localized permitting process into a standard and streamlined experience for our customers.\nWe're looking for customer-obsessed, ambitious, and hard-working teammates who are excited about solving a real-world problem with technology at its helm.\nNYC Onsite Roles | apply at: https://jobs.ashbyhq.com/permitflow?departmentId=d33195eb-89...\n1. Staff Software Engineer - $200K-275K + equity\n2. Fullstack Software Engineer - $125-215K + equity\n3. Senior Frontend Engineer - $125K-190K + equity\nhttps://permitflow.com/hiring\nreply"
    },
    {
        "hnuser": "Jreys",
        "date": "2024-07-01T16:38:19",
        "comment": "Vaarst | UK, Bristol - Hybrid | Full or part time | can't sponsor visas\nVaarst focuses on the energy transition space, we're currently developing autonomy solutions for offshore wind where we're working on subsea autonomous visual inspection combined with our data and ML platform and SubSLAM technology.\nWe are growing quickly and looking for people who enjoy working on challenging projects in fast paced environments - think deploying autonomous robots to autonomously survey subsea structures.\nRobotics, Senior and Principal Engineers - £100-150k Software, Senior and Principal Engineers (C++, Python, Computer vision, SLAM) - £100-150k Unreal Engineers, Senior and Principal UX Designers Product Managers\nhttps://careers.vaarst.com/#jobs\nreply"
    },
    {
        "hnuser": "jomkr",
        "date": "2024-07-01T20:10:11",
        "comment": "Not looking but great to see Bristol represented!\nreply"
    },
    {
        "hnuser": "burnaway",
        "date": "2024-07-01T18:41:15",
        "comment": "IVPN | Senior Infrastructure Engineer | Remote (UTC-1 to UTC+3) | Full-time | https://www.ivpn.net\nIVPN is a privacy-focused consumer VPN service in operation since 2010. We have high ethical standards, regular security audits and a stellar reputation among security and privacy analysts.\nWe are looking for a Senior Infrastructure Engineer to help: -- maintain our existing infrastructure -- implement a new server architecture for our VPN gateways that we have been working on for the past year that is open, immutable, diskless, secure and built on bare-metal servers\nThe position is fully remote with high level of autonomy.\nRequirements are experience with: -- infosec, specifically with regards to cryptographic controls used on servers e.g. Public key crypto, reproducible builds, TPM -- TCP/IP, UDP, SSL/TLS and other related Internet protocols -- configuration management tools e.g. Ansible, Puppet, Salt -- managing Linux servers, including bare-metal -- Python, Go or other scripting languages\nYou can email me if you have any questions about the role: viktor at ivpn.net.\nIf you are ready, it's better to apply here: https://ivpn.recruitee.com/o/senior-infrastructure-engineer-...\nNote: target budget for this role is 55k to 70K EUR pa. depending on experience.\nreply"
    },
    {
        "hnuser": "jmintz",
        "date": "2024-07-05T16:37:33",
        "comment": "Valon (Series B, Fintech)| NYC Office, US Remote friendly | Full Time | Base + Equity + Benefits (Unlimited PTO, $400/monthly for groceries&food) | Python, React, GCP, Kubernetes, MySQL | https://boards.greenhouse.io/valon\nI (Jake) joined in February and love the people, the mission, and the challenges of the market. Mortgage servicing is one of those remaining businesses that hasn't been disrupted by software yet; Valon is (finally) the first to build new end-to-end software.\nValon’s mission is to champion homeowners as the partner they trust with their home and future. Our ultimate goal is to guide homeowners through every step of their financial journey, no matter what life puts on their path. Mortgage servicing is a a-cyclical business and gets paid a recurring revenue based on mortgage loans outstanding (which doesn't really change even when mortgage originations slow). Our revenue grew to $30 million in 2023 as we 5x'd our loan count.\nRoles and Teams (50+ engineers): Senior SWE for Money Movement Product teams, Platform and Senior Product Managers!\nFeel free to reach out to learn more: lisa.yin@valon.com.\nreply"
    },
    {
        "hnuser": "blacksharkAI",
        "date": "2024-07-01T17:17:53",
        "comment": "Blackshark AI | Senior Software Engineer & Senior Machine Learning Engineer | Full-time | Austria or Remote EU | VISA sponsorship available\nSatellite and drone imagery access is on the rise, and traditional image processing methods are struggling to keep up. Our scalable AI quickly extracts global features, providing real-time, on-demand geospatial insights with impressive speed and accuracy. We are turning months of manual work into mere minutes, and with much better results. Our platform also powers our 3D synthetic solutions, which enable large scale simulations and visualizations. Our applications cover various domains, from intelligence and defense solutions for US and US allies to disaster relief, flight simulation and training, insurance, smart cities, urban planning, and more.\nBackend Tech Stack: Python Fast API PostgreSQL Docker RabbitMQ Kubernetes Azure\nDeep Learning: Pytorch, Torchvision, scikit-learn\nImage Processing: Numpy, PIL, OpenCV, SciPy, scikit-image, matplotlib, kornia\nGeospatial: RasterIO, Geopandas, GDAL/OGR, QGIS, ArcGIS\nSenior Software Engineer: https://blackshark.sprad.io/etorCk\nSenior Machine Learning Engineer: https://blackshark.sprad.io/Z55BY\nor reach out to HM at: 'eivanov@' + username[:10] + '.' + username[10:].lower()\nreply"
    },
    {
        "hnuser": "mi3law",
        "date": "2024-07-01T16:19:45",
        "comment": "AO Labs | Building an alternative to backpropagation | https://www.aolabs.ai/ | Berkeley, CA + remote\nAI systems struggle with edge cases and understanding local context despite increasing model sizes. From our research at UC Berkeley into the evolution of intelligence from simple organisms, we’ve discovered the missing link is continuous learning (deep learning is pre-trained by design). Models built with our framework learn through customizable parameters similar to animal instincts, allowing for AI grounded with built-in memory and reasoning. We're a community of 160+ developers and researchers building general intelligence from the bottom-up from places like Berkeley, NYU, Imperial College, and Google.\nWe're building way outside of the current paradigm and we're looking for collaborators at all levels --hackers, contributors, the curious-- as we'll be making our first hires soon. Email with \"HN Hiring\" in subject line to: ali at aolabs.ai or chat with us in our discord: https://discord.gg/Zg9bHPYss5\nThis post is near identical to mine from last month; if you reached out then, please know that I'll respond to you soon (I've been busy wrapping up a fundraise).\nreply"
    },
    {
        "hnuser": "lakrikor1",
        "date": "2024-07-01T18:57:26",
        "comment": "Can you fix the FAQ boxes on your website to be clickable...or are they not supposed to be clickable? I would like to learn more about your mission.\nreply"
    },
    {
        "hnuser": "mi3law",
        "date": "2024-07-02T01:13:54",
        "comment": "Agh I'll debug it, sorry. Please join us on discord to chat!\nreply"
    },
    {
        "hnuser": "wwjob",
        "date": "2024-07-02T08:11:36",
        "comment": "Waitwhile | Stockholm, Sweden | Onsite/hybrid remote | Full-time Waitwhile works to eliminate the 1 trillion hours that people spend waiting in lines every year. Our platform is trusted by over 10,000 companies worldwide and has helped more than 250 million people enjoy a radically better waiting experience at places like IKEA, Louis Vuitton, Costco, Tribeca Film Festival and more. Hiring for multiple roles for our Stockholm office. Come join our wonderful, supportive team!\n- Frontend Software Engineer: Junior or senior frontend focused engineer with big interest in building scalable and maintainable apps built with modern Angular and RxJS based in Stockholm. https://careers.waitwhile.com/jobs/4537202-software-engineer...\n- Solutions Engineer: Customer facing product expert and problem solver with engineer chops based in Stockholm. https://careers.waitwhile.com/jobs/3245527-solutions-enginee...\nreply"
    },
    {
        "hnuser": "aketchum",
        "date": "2024-07-01T15:11:03",
        "comment": "VIVA Finance | Atlanta, GA | Junior/Senior Back-End and React Developers, Project Manager\nVIVA is a Fintech Startup based in Atlanta, GA with the mission to build a more inclusive financial system. VIVA offers unsecured personal loans to subprime customers who have traditionally been excluded and taken advantage of by the legacy financial institutions. The VIVA difference is to underwrite heavily on employment history and set up repayments through voluntary direct deposit payments from the borrower paycheck.\nWe are a VC backed company and have been in business for 5 years. We hit cash-flow positive in May and are now default alive with our ongoing growth series B likely to be our final round. We are growing the team to further support our personal lending product, in addition to getting the staff to support building new products to diversify our revenue streams.\nOur tech stack for the back-end is fully on AWS, using Lambda and ECS for compute and Typescript as the language, but experience with this specific stack is not necessary for talented candidates. Preference is given to candidates who can come 4 days a week to our new office on the Atlanta Beltline (next to Krog Street Market) but remote positions are available for strong candidates able to work hours in eastern timezone.\nSend me an introduction (alex at viva-finance.com) with a resume and we will be in touch!\nreply"
    },
    {
        "hnuser": "malasgarli",
        "date": "2024-07-05T06:20:05",
        "comment": "(TOP SALARY + 3-4% EQUITY) Carma (YC W24) Hiring an 10X Founding Full-Stack Engineer | FULLTIME | REMOTE (US) | San Francisco, CA, USA\nOur Stack: React / React Native / Node.js / NestJS\nHN friends, Carma’s business is growing rapidly and we are in urgent need of an exceptional 10X full-stack founding software engineer (100% remote). We raised a top seed and were one of the highest-revenue generating companies in our batch.\nWe are offering $150K-$175K + 3.00%-4.00% for a best-in-class first engineering hire. We want this engineer to be fully bought-in and develop into a Head of Engineering role in the next 12-18 months, which is why we are offering top salary and significant equity. Any interest in automotive is a plus. Here is the link to the role description: https://www.ycombinator.com/companies/carma/jobs/v6CTeFv-fou...\nIf are a strong full-stack engineer that can fit this role, we want to speak with you ASAP. We move fast with same-day decisions after the interview.\nPlease apply at the above link (you application will come directly to me) or email me your resume directly at muhammad@joincarma.com. You can also call or text me directly: 636-293-5254 (Muhammad, CEO).\nreply"
    },
    {
        "hnuser": "abelanger",
        "date": "2024-07-01T16:03:44",
        "comment": "Hatchet (https://hatchet.run) | New York City (IN-PERSON) | Full-time\nWe're hiring a founding engineer to help us with development on our open-source, distributed task queue: https://github.com/hatchet-dev/hatchet.\nWe recently launched on HN, you can check out our launches here https://news.ycombinator.com/item?id=39643136 and here https://news.ycombinator.com/item?id=40810986. We're two second-time YC founders in this for the long haul and just wrapped up the YC W24 batch.\nAs a founding engineer, you'll be responsible for contributing across the entire codebase. We'll compensate accordingly and with high equity. It's currently just the two founders + a part-time contractor. We're all technical and contribute code.\nStack: Typescript/React, Go and PostgreSQL.\nTo apply, email alexander [at] hatchet [dot] run, and include the following:\n1. Tell us about something impressive you've built.\n2. Ask a question or write a comment about the state of the project. For example: a file that stood out to you in the codebase, a Github issue or discussion that piqued your interest, a general comment on distributed systems/task queues, or why our code is bad and how you could improve it.\nreply"
    },
    {
        "hnuser": "banach_space",
        "date": "2024-07-01T19:01:46",
        "comment": "Forklifts and Postgres - export startup backed by patio11 is hiring its second engineer - Full-time | London, Acton | 80k base + 0.5% equity\nAbout us: Revenue for June 2024 was just over £300,000, an over 5-fold increase on this time last year.\nWe're an export company, investors include patio11, charlie songhurst and Backed VC. Myself (Ethan) and Ruairidh started the company while students at Cambridge in August 2021, and after several pivots have ended up in logistics/export, fast growing, and profitable. We're chasing down £1m monthly revenue in December 2024, and want someone who loves the idea of shipping code and containers to get us there\nAbout the role: Our first software engineering hire is joining next monday, and we are looking for one more, to write code on the desk next to me! You'll be shipping code to support new sales channels, wiring up label printers, probably eating an unhealthy amount of takeaway as a deliveroo editions is on the same warehouse block as us, and potentially being a backup forklift driver.\nWe disproportionately value earnestness and willingness to solve messy problems than extensive tech experience. Solving problems in logistics can involve a mix of code writing, data cleaning, and filling out forms. You were warned :)\nEmail me ethan@dirac.software if interested!\nreply"
    },
    {
        "hnuser": "esac",
        "date": "2024-07-05T12:39:54",
        "comment": "Silverstream | https://www.silverstream.ai/ | Founding Software Engineer, Senior Software Engineer | Full-Time | On-Site | San Francisco Bay Area\nSilverstream is a fast-growing early-stage startup democratizing AI agents. We’re developing a cloud platform to create production-ready, in-house, browser-based AI agents. We’re at an inflection point in our growth and moving quickly. We’re in search of a passionate software engineer who will help scale our platform and influence the core technology. This position can be tailored to either a Senior Software Engineer or a Founding Software Engineer, depending on your experience and career goals.\nFor more details and to apply, please check the links below:\n- Founding Software Engineer : https://silverstream.zapier.app/founding-software-eng\n- Senior Software Engineer : https://silverstream1.zapier.app/senior-software-eng\nFor questions, please reach out to me : jobs at silverstream.ai\nreply"
    },
    {
        "hnuser": "_praf",
        "date": "2024-07-01T23:41:50",
        "comment": "Column (https://column.com/) | Software Eng (Backend), Software Eng (Infrastructure) | San Francisco, CA | Full Time\nColumn is the first nationally chartered bank built from the ground up for developers. We provide an API first, modern banking experience for our customers, replacing the bloated middleware and legacy software that currently powers most financial companies.\nStarted by the co-founder of Plaid, Column has a team of <10 engineers and is currently processing hundreds of billions in payments annually, supporting some of the largest and most sophisticated fintech companies. We are looking for experienced backend and infra engineers to join our team. We all work on high impact, independently driven projects - writing code for regulated financial infrastructure at scale.\nApply here: https://column.com/careers or read more about our hiring philosophy here: https://column.com/blog/hiring-at-column\nFeel free to email me with any questions: praful@\nreply"
    },
    {
        "hnuser": "grylance",
        "date": "2024-07-05T10:35:15",
        "comment": "Boiler Room | Lead Full Stack Developer | London / Hybrid Remote | Part-time (4 days per week) | https://boilerroom.tv/ | No VISA sponsorship\nBoiler Room is an underground music platform. We’re looking for an experienced engineer to join us & lead our small team. You will have autonomy to build the next phase of our tech in the way you see fit. You will be joining a small but mighty cross functional and multi disciplinary team.\nWe’re currently working on improving the data sets & analytics that help us sell tickets & apparel, solving difficult scaling & stability challenges as our audience grows, plus building an iOS app where fans can listen without ads.\nOur stack currently: NodeJS, JavaScript, Typescript, GraphQL, Apollo, React, Python, Django, AWS, Cloudflare.\nWe adhere to functional programming principles and foster a culture of engineering excellence in our team.\nPerks include private healthcare, ClassPass, free food & snacks, a dog friendly office, free clothes quarterly from our collection & guest list to our parties around the world.\nThe role is part-time 4 days a week. Competitive salary benchmarked against data from March 2024. Must have right to work in UK.\nApply here: https://boards.greenhouse.io/boilerroom/jobs/7273620002\nQuestions? Let's talk, email us at productjobs@boilerroom.tv\nhttps://boilerroom.tv/\nreply"
    },
    {
        "hnuser": "justin_sdx",
        "date": "2024-07-01T15:02:14",
        "comment": "SmarterDx | 150-230k+ + equity + benefits | Remote (US only) | Multiple roles | https://smarterdx.com/careers\nWe are a rapid growth health tech company using AI to improve hospital revenue cycle (making healthcare costs lower and allowing doctors to focus on patient care). The current team is very high functioning (MD + data scientist combos, former ASF board member, Google and Amazon engineers, Stanford LLM researchers, etc.) and initially scaled the company to $1MM+ in contracted revenue without raising capital.\nWe have been backed by top investors including Floodgate (Lyft, Twitch, Twitter), Transformation Capital, and Bessemer for a total of $71mil, including our $50mil Series B announced in May 2024, and are currently on pace to 20-30X in revenue over a two-year time period.\nWe are looking for: Staff and Senior SWE - Senior and Non-Senior Data Engineers and Scientists - Engineering Managers (SWE + Data) - Sales - Several more roles\nWe have PMF, and it's time to scale! For more and to apply, see https://smarterdx.com/careers\nreply"
    },
    {
        "hnuser": "carol_l",
        "date": "2024-07-03T16:35:36",
        "comment": "Hello Justin,\nI applied for a Data Engineer role at SmarterDx and got rejected prior getting any screening.\nI was wondering if you could provide me any feedback on my resume and past experience, so that I can either update my resume or skillset.\nThank you\nreply"
    },
    {
        "hnuser": "StellarScience",
        "date": "2024-07-04T18:34:20",
        "comment": "Stellar Science | Hybrid USA Washington DC (Tysons VA), Albuquerque NM, Dayton OH | Full time, INTERNS/co-ops | U.S. citizenship required | https://www.stellarscience.com\nCompany: We're a small scientific software development company that develops custom scientific and engineering analysis applications in domains including: computer vision and image processing, space situational awareness (monitoring the locations, health and status of on-orbit satellites), metamaterials design, image simulation, high power microwave systems, modeling and simulation, machine learning, physics informed neural networks (PINN), human body thermoregulation, laser systems modeling, high performance computing (HPC), computer aided design (CAD), and more. All exciting applications and no CRUD. We emphasize high quality code and lightweight processes that free software engineers to be productive.\nExperience: We typically look for Bachelors degrees in computer science, physics, engineering, math, or a related field, and also hire Masters and PhDs (roughly 30% of our staff have PhDs.)\nTechnologies: Mostly C++20/23, Qt 6.5, CMake, Boost, Jenkins, git, OpenGL, CUDA. Windows and Linux, msvc/gcc/clang/clangcl. Some projects use Python, Java, or Javascript.\nApply online at https://www.stellarscience.com/careers/.\nreply"
    },
    {
        "hnuser": "koraxtu",
        "date": "2024-07-06T21:06:57",
        "comment": "Hi StelSci, you've mentioned interns & co-ops but I don't see any matching positions on your website. How would I apply for such positions?\nreply"
    },
    {
        "hnuser": "htien",
        "date": "2024-07-02T12:27:47",
        "comment": "ROCKSTAR GAMES | NYC-San Diego-New England| FULL-TIME | .NET SOFTWARE ENGINEERS | Existing Visa Transfers Welcome\nA career at Rockstar Games is about being part of a team working on some of the most creatively rewarding and ambitious projects to be found in any entertainment medium. You would be welcomed to a dedicated and inclusive environment where you can learn, and collaborate with some of the most talented people in the industry.\nRESPONSIBILITIES\nDevelop highly scalable server-side features for our online game console clients using object-oriented development in C#, ASP.NET, and SQL Server.\nDevelop back-end services and APIs. Actively practice Test Driven Development (TDD) while developing new features and refactoring existing code.\nWork in an AWS cloud-based, event-driven microservice architecture with a high priority on web performance optimization.\nCollaborate with other Rockstar technology teams across our worldwide studios.\nNew York: https://www.rockstargames.com/careers/openings/position/5959...\nSan Diego: https://www.rockstargames.com/careers/openings/position/5955...\nNew England: https://www.rockstargames.com/careers/openings/position/5959...\nYou can see our other openings here: https://www.rockstargames.com/careers/\nreply"
    },
    {
        "hnuser": "uczekalla",
        "date": "2024-07-02T12:25:41",
        "comment": "CodeWeavers | St Paul, MN, USA | Full Time | REMOTE | Wine and General Open Source Developers | C-language systems programming\nhttps://www.codeweavers.com/about/jobs\nCodeWeavers needs new, full-time developers to improve Wine's ability to run games and other types of software and integrate well with the native operating system and other system components. Positions are available to work on a variety of Wine-based software, including CodeWeavers's own CrossOver product; the Proton project for Valve Software; and projects for other clients and software internal to CodeWeavers.\nWe are hiring remote programmers, US or international, as well as workers local to Saint Paul, Minnesota. We will consider relocation, if desired, on a case-by-case basis. Please see link above for information, benefits, requirements, and how to apply.\nPlease direct any questions to the email address on our Jobs page.\nreply"
    },
    {
        "hnuser": "kmax12",
        "date": "2024-07-01T22:22:54",
        "comment": "Grid Status | Senior Software Engineer | Remote or Hybrid Chicago | Full-time | https://www.gridstatus.io/\nGrid Status is one of the most widely used energy data platforms in the world. Our data has been used in reporting and analysis by the Wall Street Journal, New York Times, the Federal Reserve, and by thousands of users who regularly visit our products every month.\nAs one of the first members of our engineering team, you will have a hand in both defining and implementing the product we deliver to customers. No experience in the energy industry is necessary—just a strong eagerness to learn. Our team’s passion and expertise will help you quickly get up to speed.\nOur stack is mostly: python, react, postgres, snowflake, AWS\nJob posting: https://gridstatus.notion.site/Senior-Software-Engineer-7a2a...\nTo apply: email us at jobs@gridstatus.io with a resume, link to any projects, and why you're a fit for the role.\nreply"
    },
    {
        "hnuser": "motwanimo",
        "date": "2024-07-02T08:33:21",
        "comment": "Hey, would you be open to applications from other countries ex - UK for remote roles?\nreply"
    },
    {
        "hnuser": "jordaneast",
        "date": "2024-07-05T21:23:03",
        "comment": "Building Swell | Customer Success Manager | Remote | Full-time\nFast-track your career by joining our growing team, where you will have the autonomy to drive the company to new heights and leave an impact on an industry at the cusp of incredible change.\nYou are: someone deeply curious, constantly looking to learn the \"why\" behind customer actions. You care about helping customers unlock their own potential and leverage best CSM practices to leave a real impact. You’ll be driving the direction of customer implementation, support, and user research; shaping the future of the company and the construction industry.\nAt Building Swell, we know construction is ushering in a new wave of industrialization. Join us in arming these modern builders with mission-critical technology to manufacture smarter buildings and address the housing shortage.\nPosition: Customer Success Manager\nLocation: USA or Canada\nIf interested, please reach out at careers at buildingswell dot com\nreply"
    },
    {
        "hnuser": "asta-li",
        "date": "2024-07-01T16:49:35",
        "comment": "Privy | Onsite NYC (Preferred) or Remote (US/Canada) | Hybrid Product/Eng, Frontend, Fullstack, Backend Roles | Full-Time | https://privy.io\nHi, I'm Asta, CTO at the digital identity startup Privy. We build an authentication and cryptographic key management SDK that hundreds of companies integrate in order to onboard users (7M+ in the past year) onto products built with blockchain infra and distributed systems.\nWe believe that when users own cryptographic keys, we shift the status quo so that users control more of their data and assets online. Privacy is fundamentally about ownership and revocation. User experience is our North Star, because users won't compromise on UX.\nWe're a small, high-ownership team building a product with real usage (>2M MAUs, massive transaction volume) that developers love. We've raised $26M from Sequoia & Paradigm. We ship constantly - multiple production releases per week.\nReach out at join [at] privy.io - these emails go to me. https://jobs.ashbyhq.com/privy\nreply"
    },
    {
        "hnuser": "PMacDiggity",
        "date": "2024-07-02T20:13:24",
        "comment": "OT, but would really appreciate if you guys offered Passkeys and regular passwords, the whole \"check your email\" thing is really annoying.\nreply"
    },
    {
        "hnuser": "a13n",
        "date": "2024-07-01T17:44:27",
        "comment": "Canny | Software Engineer, Account Executive | REMOTE | Full-time | https://canny.io\nCanny helps software companies keep track of feature requests to build better products.\n* Small SaaS business, 16 person team, $3m+ annual recurring revenue\n* 100% remote, distributed across US, Canada, Mexico, Spain, Turkey\n* Bootstrapped and profitable\nhttps://careers.canny.io/?utm_source=hn\nWhy work at Canny: https://canny.io/blog/work-at-canny/\nreply"
    },
    {
        "hnuser": "stirredo",
        "date": "2024-07-04T15:31:17",
        "comment": "See their glassdoor before applying. They send you take-away assignment and even if you do everything correctly they will ghost you.\nreply"
    },
    {
        "hnuser": "hudson-trading",
        "date": "2024-07-01T15:02:00",
        "comment": "Hudson River Trading | Hybrid | Full-time\nWe’re a quantitative trading firm based in NYC that trades hundreds of millions of shares each day on over 200 markets worldwide. We use math and technology in everything we do; our talented developers, engineers, and programmers build complex models and systems that allow us to make automated trading decisions on global markets.\nWe’re looking for:\nTechnical Product Manager | NYC | https://www.hudsonrivertrading.com/careers/job/?gh_jid=54008...\nData Production Engineer | NYC, London | https://www.hudsonrivertrading.com/careers/?q=data+productio...\nCloud Solutions Architect | London | https://www.hudsonrivertrading.com/careers/job/?gh_jid=58809...\nLow Level Software Engineer (C++) | Singapore | https://www.hudsonrivertrading.com/careers/job/?gh_jid=12290...\nAnd more! For more information about our benefits, check out Life at HRT: https://www.hudsonrivertrading.com/life-at-hrt/\nreply"
    },
    {
        "hnuser": "cube2222",
        "date": "2024-07-01T15:27:29",
        "comment": "Spacelift | Remote | Europe | Full-time | Senior Software Engineer | $80k-$120k\nWe're a VC-funded startup building an automation platform for Infrastructure-as-Code, adding a Policy-as-Code layer above it, in order to make IaC usable in bigger companies, where you have to take care of state consistency, selective permissions, a usable git flow, etc.\nOn the backend we're using 100% Go with AWS primitives. We're looking for backend developers who like doing DevOps'y stuff sometimes (because in a way it's the spirit of our company), or have experience with the cloud native ecosystem. Ideally you'd have experience working with an IaC tool, i.e. Terraform, Pulumi, Ansible, CloudFormation, Kubernetes, or SaltStack.\nOverall we have a deeply technical product, trying to build something customers love to use, and already have a lot of happy and satisfied customers. We promise interesting work, the ability to open source parts of the project which don't give us a business advantage, as well as healthy working hours. We've also got investment days on Fridays, when you can work on anything you want, as long as it could possibly benefit Spacelift in some way.\nIf that sounds like fun to you, please apply at https://spacelift.teamtailor.com/jobs/3006934-software-engin...\nYou can find out more about the product we're building at https://spacelift.io and also see our engineering blog for a few technical blog posts of ours: https://spacelift.io/blog/engineering\nreply"
    },
    {
        "hnuser": "rharb",
        "date": "2024-07-01T21:21:03",
        "comment": "Autodesk | Technical Consultant, Senior Technical Consultant, Principal Solution Architect | Remote, US | Full Time\nAutodesk has an internal consulting organization to help design solutions for our customers. We offer custom development, product plugins, and architecture review and recommendation.\nThe tech stack involves NodeJS/React front-end development and C# backend development. Backend development can be for web solutions or plugins for our products.\nOur solution architecture teams work alongside the developers and customers to help design solutions either directly for the customers, or for our teams to implement.\nCurrently we have three consultant positions available with more becoming available later this year - we're growing!\nhttps://careers.autodesk.com The specific consulting positions are req IDs (searchable in Workday) 24WD79331, 24WD79332, 24WD79342\nIf you have any questions or would like to grace me with the use of a referral link - please reach out at rob dot harbaugh [AT] $companyname dot com\nreply"
    },
    {
        "hnuser": "alexpropp",
        "date": "2024-07-01T16:27:31",
        "comment": "Founding Engineer Location: San Francisco Employment: Full-time, Hybrid (3 days in person)\nWe're rebuilding the financial ledger, revolutionizing how multi-location businesses assess their performance, and empowering them to make better and more timely decisions. Our software streamlines data collection, reporting, and analysis, arming business owners with the insights they need to thrive.\nWe're looking for a talented and passionate Founding Engineer to join us early, working closely alongside the founding team. Our tech stack includes Rust, Typescript, Next, WASM, and Postgres.\nReach out to alex@contour.app to apply.\nreply"
    },
    {
        "hnuser": "c_mackay",
        "date": "2024-07-05T00:34:26",
        "comment": "Tuza [formerly Statement] | Senior Full-Stack Software Engineer | London | Full-time | Onsite [2/3 days in office]\nAt Tuza we are building the exchange for payments processing. Like insurance & credit, payments processing is an industry priced on risk. On the surface, our product enables businesses to compare rates across multiple acquiring banks. If you dig deeper, we are building the tools for banks to accurately price their risk in real time. This feeds our comparison product and will eventually allow us to route payments from the terminal level to price optimise for our merchant customers. Today a corner shop with a turnover of £300k could save £5k+ a year in processing fees. We are backed by Europe's top fintech investors [Klarna, TrueLayer etc] and are growing the team [ex WorldPay, Klarna, CityMapper]. We are looking for engineers with fintech pedigree who share our obsession with building world-class product.\nLet's talk. Apply online: https://www.tuza.co.uk/careers Better yet, email me: calum@tuza.co.uk [if you're good, there won't be a process]\nreply"
    },
    {
        "hnuser": "Treesrule14",
        "date": "2024-07-01T16:47:00",
        "comment": "Fractional AI | Founding Engineer | San Francisco | Onsite | Full-time\nWho: We're Fractional AI -- the dev shop for difficult enterprise applications of genAI.\nLooking for: You! Full-stack founding engineers (5+ years of experience, 150k-210k cash, meaningful equity, 99% healthcare premium coverage )\nHow: apply https://jobs.lever.co/fractional or reach out to me (ben@ fractional.ai)\nWhy we may be a great fit:\n-High impact AI projects - we work on companies' hardest problems to get genAI into production (in the same quarter you might build an AI phone agent for one customer and automate a complex workflow for another customer)\n-Culture of a startup but substantive problems to solve that impact millions of users\n- Curious, humble, banter-y in-person team comprised of multi-time founders\nWhy we may not be the best fit:\n-Excellence isn't really really important to you (this is less of a 'move fast and break things' role, though we respect that ethos!)\n-Predictability is important to you - we work across customers, tech stacks, industries etc\n-Interacting with customers isn't your thing\nreply"
    },
    {
        "hnuser": "peter-atrium",
        "date": "2024-07-01T20:51:41",
        "comment": "Atrium | Backend/Infra Engineer | Remote | Full Time\nWeb: https://atrium.st\nABOUT: At Atrium, we are building an AI Powered Search engine for entities (companies and people) and topics. We are automating the construction of the world's largest open knowledge graph of companies, people and their relationships. We enable businesses to perform much more detailed comprehensive analysis of businesses surfacing information such as 1) Competitive landscape, 2) Product Whitespace, 3) ICPs and contacts who are likely to be customers\nPOSITION: We're seeking a talented Python Engineer to join our growing team and help build the future of AI-driven business analytics. Ideal candidate should have a strong grasp of AI and machine learning concepts, particularly in the realm of large language models (LLMs) and AI agents. Familiarity with GCP services is essential, as is experience with building scalable data pipelines.\nAPPLY: email us at: careers.24.07@atrium.st\nreply"
    },
    {
        "hnuser": "drawnwren",
        "date": "2024-07-01T21:56:19",
        "comment": "FYI: your page is just dead for me. I was curious what you were doing, but all your examples and the search box itself just lead to \"Something went wrong with your request. You have nothing to worry about, please try again in a moment.\"\nreply"
    },
    {
        "hnuser": "op00to",
        "date": "2024-07-02T00:03:26",
        "comment": "well duh that's why they need the backend/infra engineer! figure it out and you got the job! :D\nreply"
    },
    {
        "hnuser": "dark_star",
        "date": "2024-07-05T03:23:17",
        "comment": "Apple | https://apple.com | AIML – Sr Full-stack Software Engineer, Data Operations | FULLTIME | ONSITE / HYBRID (3 days in office, 2 at home) | Seattle, WA, USA\nhttps://jobs.apple.com/en-us/details/200551324/aiml-sr-full-...\nOur team builds software to collect and annotate high-quality data used to train LLMs and other AI and ML models for products across Apple. We're looking for a senior software engineer who can design and build mission-critical, large scale, cloud-based distributed systems, web-based APIs and web apps, and can be the technical lead for projects within our team and across teams. The ideal person would have strong technical skills, strong collaboration skills, and strong people skills. See the job description above for details.\nI'm the hiring manager, if you apply your application will come directly to me.\nreply"
    },
    {
        "hnuser": "michaelm244",
        "date": "2024-07-06T01:22:54",
        "comment": "Comulate | Senior Engineer (3+ YoE) | ONSITE in San Francisco, CA\nWe're building automation software for the insurance industry that had our first customer crying tears of joy. Seed stage in terms of headcount (< 20 people) but Series B in terms of business traction (+ cash-flow positive).\nExperienced, high-caliber, eng team from Airbnb, Asana, Brex, AWS, and LiveRamp. Building a product-focused eng culture in which engineers work directly with customers. Stack is full-stack TypeScript, Postgres, React, GraphQL, and Next.js.\nIntentionally under the radar: we focus instead on delivering for customers and building a category-defining company.\nApply here: https://comulate.com/careers\nreply"
    },
    {
        "hnuser": "wundegraphTeam",
        "date": "2024-07-01T19:56:20",
        "comment": "WunderGraph | Multiple Roles | REMOTE | Full-Time WunderGraph (growing global customer base, 20K weekly downloads and growing)\nAPIs are the backbone of every modern organization. But building and maintaining APIs is hard, especially when you'd like to scale API development across multiple teams. The key to success is collaboration.\nOur mission is to take API collaboration to the next level. With Cosmo, we're give platform teams a solution to provide a self-service API Developer Platform to their teams. We believe that Open Source is the key ingredient to become the number one solution for API Development and Collaboration.\nThe project is completely open-source.\nYou will be an integral member of an expanding team at a VC-funded startup with a dynamic mission to innovate and transform the field of GraphQL Federation.\nApply here: https://wundergraph.com/jobs#open-positions\nor email me directly at stefan [@] wundergraph.com\nreply"
    },
    {
        "hnuser": "d3mcfadden",
        "date": "2024-07-01T15:32:49",
        "comment": "Empower Delivery | Engineering | Remote (US ony) | Full-time\nWe're a restaurant tech company on a mission to make restaurants better for everyone. We offer a full end-to-end product that allows customers to run their own online ordering, process the orders using our kitchen suite and deliver the orders using their own dedicated fleet of drivers. We strive to give restaurants back the control they've lost to the third party middlemen.\nWe run a monorepo Elixir/Phoenix LV codebase backed by Postgres. We maintain a couple native apps that leverage KMM and SwiftUI/Jetpack.\nWe're a small remote-first company based out of Indianapolis, IN.\nWe're seeking senior level talent to join our team. You will work across a wide problem space in a pretty fun domain.\nElixir experience a plus, but not required.\nPositions:\n  - Senior Engineer - Full-Stack Elixir/LV\n  \n  - Mobile Engineer - KMM / iOS / Android\nIf you are interested please reach out to me at dan 'at' empower.delivery.\nreply"
    },
    {
        "hnuser": "applehire",
        "date": "2024-07-01T18:58:57",
        "comment": "Apple | Senior Software Engineer | Austin & Cupertino | Full-time | Onsite\nThe ASE Data Infrastructure team is seeking an experienced senior software engineer to contribute to the development of our next-generation object storage infrastructure. As a key member of our team, you will play a critical role in designing and implementing solutions that enable seamless collaboration across Apple engineering teams.\nRequirements:\n- In-depth experience with object storage implementations: S3, GCS, Azure Blob Storage, MinIO, and Ceph - we are looking for candidates who have hands-on expertise with these technologies.\n- Proficiency in Rust: You will be working extensively with the Rust programming language to build high-performance systems.\n- Expertise in debugging and performance analysis: Experience driving performance analysis of end-to-end distributed systems is essential. We need someone who can quickly identify and resolve issues at scale.\n- Micro-services architecture and container orchestration expertise: You have experience working with containers (e.g., Docker) and orchestrated them with tools like Kubernetes or similar. This knowledge is critical to our system's scalability and reliability.\n- Relational and non-relational database expertise: PostgreSQL, Cassandra, and other databases are your area of specialization. You know how to design and implement efficient data storage and retrieval systems.\n- Experience in data migration, disaster recovery, and capacity planning: We're talking about large-scale data management here. Your experience in these areas will be invaluable.\nResponsibilities: Review and provide constructive feedback on pull requests and designs, fostering a culture of continuous learning and knowledge sharing. Collaborate with other senior team members across multiple sites to define high-quality and reliable standards for our solutions.\nLocation: Austin & Cupertino (onsite work required)\nIf you're passionate about building innovative software and pushing the boundaries of data storage, we want to hear from you! You can either apply directly (https://jobs.apple.com/en-us/details/200556764/senior-softwa...) or send me an email at mansur.ashraf@<company name>.com\nreply"
    },
    {
        "hnuser": "aysenurkpln",
        "date": "2024-07-02T08:11:16",
        "comment": "Datenna | Senior DevOps Engineer | Full-time | On-site Eindhoven, Netherlands | Hybrid (3 days in the office)\nAt Datenna, we combine China expertise, OSINT, data and AI technologies, to create a software platform that provides the insights governments need to explore the hidden connections between China’s complete corporate, academic and technological landscape.\nWe are looking for a Senior DevOps Engineer who will help us shape the future of our SaaS solution. You’ll have the opportunity to make a tangible impact and help support and improve our groundbreaking OSINT platform.\n#DevOps #Kubernetes #Cloud Providers #Git #CI/CD #Python #Shell\nRead more: https://jobs.datenna.com/o/senior-devops-engineer-2-3\nreply"
    },
    {
        "hnuser": "arnoooooo",
        "date": "2024-07-02T16:14:04",
        "comment": "Hozana | Lyon, France or remote from France | https://www.hozana.org/\nWe're a Catholic tech non-profit committed to creating digital solutions for spiritual growth and community building.\nWe have about a million active users on our apps: https://hozana.org and https://rosario.app\nWe are hiring:\n- a polyvalent Backend engineer\n- a traffic manager\n- a QA analyst (part-time)\nFind out more and apply at https://www.welcometothejungle.com/fr/companies/hozana/jobs\nreply"
    },
    {
        "hnuser": "protoduction",
        "date": "2024-07-04T11:16:08",
        "comment": "Friendly Captcha | Integrations Engineer | REMOTE within EU | PART-TIME or FULL-TIME | Office in Munich, Germany | https://friendlycaptcha.com\nAt Friendly Captcha we do one thing and we do it well: we protect websites from malicious actors and bots.\nWe provide privacy-friendly and accessible anti-bot solutions that don’t annoy users with tasks like clicking fire hydrants. We make the internet a bit better every day by winning over customers currently using Google reCAPTCHA.\nWe’re a fast-growing, profitable, fully bootstrapped company. Our revenue mostly comes from medium to large European enterprise and governments.\nWe are currently looking for a (polyglot) Integrations Engineer to join our team.\nWe think investing in a great developer experience through documentation, SDKs and plugins will pay dividends, and it makes sense for us to grow our team in that direction. The role involves helping us build integrations and plugins for various platforms, and talking to developers who are integrating Friendly Captcha to learn where we can improve. We think the right hire will shape the role themselves.\nOur engineering team is remote across Europe, we meet up once per quarter or so. You can work either 4 or 5 days per week, remote or (partially) from our Munich office. Please note that we ONLY consider candidates located within the EU, EEA or UK.\nStack: Golang | Typescript | Clickhouse | Postgres | Redis\nCheck out https://friendlycaptcha.homerun.co/integrations-engineer for more details.\nreply"
    },
    {
        "hnuser": "luisageorgiana",
        "date": "2024-07-01T15:46:01",
        "comment": "Modash.io | Remote | Full-time | Europe\nHey there! Meet Modash.io\nOur goal?\nTo help brands and creators create awesome connections with their target audiences using data-driven influencer marketing magic . With our tech and savvy data analysis, we're giving our clients the insights and tools they need to knock their marketing campaigns out of the park!\nWho are we looking for?\nSenior Product Engineers: https://apply.workable.com/modash/j/C1507B65C3/apply/\nSenior Backend Engineers: https://apply.workable.com/modash/j/1E709F7688/apply\nSenior Data Engineers: https://apply.workable.com/modash/j/AA0F9628B4/apply\nGrowth Engineer: https://modash.workable.com/jobs/4074102/preview?show_descri...\nInterview Process?\nSay goodbye to pineapple tree sorting and Leetcode-style tasks! Our interviews are all about practical challenges and real-world scenarios, so you can showcase your skills in the most relevant way possible.\nMore details here: https://www.modash.io/blog/engineering-interviews-at-modash\nAll roles we have, including non-engineering ones: https://apply.workable.com/modash/\nreply"
    },
    {
        "hnuser": "philipkiely",
        "date": "2024-07-01T23:07:14",
        "comment": "Baseten | SF, NY, or REMOTE | Engineering | www.baseten.co\nBaseten provides fast, scalable inference for AI/ML models. We're at Series B and growing fast with great customers like Descript, Bland, and Patreon. Cool tech, unbeatable team, huge market opportunity.\nI joined Baseten 2.5 years ago after reading about it on an HN Who is Hiring thread!\nWe're actively hiring for:\n* Support Engineer: https://jobs.ashbyhq.com/baseten/ff008b8e-b38d-4941-b24f-9a4...\n* Forward Deployed Engineer: https://jobs.ashbyhq.com/baseten/84c1801c-1a65-49fb-aaaa-bee...\nreply"
    },
    {
        "hnuser": "mistidoi",
        "date": "2024-07-01T15:27:33",
        "comment": "Relevant Healthcare | Director of Engineering | Remote (USA + Canada)\nRelevant (https://relevant.healthcare) is a small and experienced team building an analytics and population health platform for non-profit clinics called Community Health Centers*. We're bootstrapped, fully remote, and hiring a director of engineering!\nRead more about the role here: https://relevant.healthcare/jobs/director-of-engineering/ Read more about Community Health Centers here: https://relevant.healthcare/jobs/\nreply"
    },
    {
        "hnuser": "jayfk",
        "date": "2024-07-01T16:42:32",
        "comment": "JUPUS GmbH | Senior Software Engineer / Emerging Leader | Cologne | REMOTE\nWe are JUPUS, one of Germany's fastest-growing legal tech startups, and we are looking for a talented and experienced Senior Software Engineer - Emerging Leader to join our team. This position offers an exciting opportunity to grow into a leadership role, providing technical guidance and mentorship to our team.\nOur stack is Python/Django in the backend and TypeScript/Vue.js in the frontend. Looking for someone who is full stack and can assist leading a team of 6 engineers. Salary is up to 84k/year.\nApply here https://join.com/companies/jupus/11486463 or send me an email at jannis.gebauer@jupus.de\nreply"
    },
    {
        "hnuser": "aidos",
        "date": "2024-07-01T19:45:02",
        "comment": "Countfire | Senior Fullstack and backend Developers| Remote (but must based in UK) | www.countfire.com\nCountfire makes software for the construction industry. Our software is well loved because we try to design solutions that are a magnitude more efficient than existing tools. We use all sorts of tech, but mostly MobX, React, Typescript, Python, Hasura, Postgres, Terraform, and AWS.\nWe have a great loyal customer base and lots of exciting ideas that need bringing to life. Previously based in London, now seeking remote devs across the UK.\nMore info here https://www.countfire.com/careers/\nFeel free to contact me directly aidan@countfire.com\nNote, applicants must be resident in the UK. No recruiters.\nreply"
    },
    {
        "hnuser": "meredydd",
        "date": "2024-07-04T16:10:39",
        "comment": "Anvil | Developer Advocate | Cambridge, UK | ONSITE, VISA | Full-time/part-time/flexible | https://anvil.works/jobs\nWe make an open-source web framework, an online code editor, a GUI builder, and a PaaS hosting platform. Together, you can build and host a full-stack web application - and all you need is a little Python. (Yes, even the client-side code - we compile Python to JS and provide a GUI framework!)\nWe’re looking for developers with great communication skills, to show people how to build awesome things with Anvil. You’ll be building example apps; writing how-to guides, blog posts and tutorials; presenting Anvil at conferences; and helping our users – from individual developers to huge tech companies – build their applications. And then you’ll help us work out how to improve Anvil for them.\nIt's rewarding work – developers love being introduced to Anvil (our stand is always crowded[0] at conferences!). Plus, there are all the advantages of a small startup: lots of autonomy and huge impact. You'll be working directly with the founders as well as some seriously talented colleagues.\nWe're bootstrapped and profitable, with customers ranging from tiny (one-person startups) to enormous (HSBC, Bayer, Deloitte, etc). For a full job description, to hear what it's like working here, and to apply, go to https://anvil.works/jobs.\nWe work hybrid (in the office Tue-Thu, wherever you like Mon/Fri), and we're not looking for fully-remote colleagues right now, but we can sponsor your UK visa. If you have questions, I'm a founder and my email's in my profile.\n[0] https://anvil.works/jobs#anvil-in-the-wild\nreply"
    },
    {
        "hnuser": "haykmartiros",
        "date": "2024-07-01T15:24:49",
        "comment": "Riffusion | Generative Music | San Francisco, CA\nLooking for world class ML research engineers and scientists to join our core team building the future of music. If you love creativity, large scale diffusion models, fast infrastructure, and early startup energy, our team may be a fit. We're building something new to inspire hundreds of millions of people. Competitive comp, in-person culture.\nContact: hayk @ riffusion dot com\nreply"
    },
    {
        "hnuser": "monument_will",
        "date": "2024-07-01T16:53:43",
        "comment": "Monument (https://joinmonument.com) | Senior Software Engineer | New York, NY | Hybrid | Full-Time\nFor people who are tired of navigating a costly and unpredictable healthcare system, Monument is the virtual care platform that takes the guesswork out of healthcare. It finds you a great doctor or therapist and enables you to reserve regular appointments so you can get the care you deserve, affordably and on your terms.\nWe're looking for a senior software engineer to join our NYC-based team (hybrid office near Penn Station).\nTech stack: NodeJS, React, Typescript, PostgreSQL, Redis, AWS w/ Terraform, Kubernetes\nIf interested please email will at joinmonument dot com\nreply"
    },
    {
        "hnuser": "Helloworldx",
        "date": "2024-07-03T15:28:05",
        "comment": "Stytch | Remote (US) | Hybrid in SF/NY or Remote | https://stytch.com\nStytch is building a developer platform for passwordless authentication. Our APIs make it simple to seamlessly onboard, authenticate, and engage users – while simultaneously improving security. To learn more about who we are, our engineering culture, and whether this is the right place for you, read our Key Values profile: https://www.keyvalues.com/stytch\nHere are our open roles: - Experienced Full-stack (Backend Leaning) - Experienced Full- Stack Engineer - Experienced Backend Engineer - Experienced Infra Engineer - Product Manager, Activation - Technical Product Marketing Manager - Developer Education\nhttps://jobs.ashbyhq.com/stytch?utm_source=OEvbo87dAp\nTech Stack: Go for backend services, Node and Typescript for our web services, Next.js and React/Typescript on the frontend. We run on AWS with Kubernetes for containerization, and gRPC and protobufs for internal service communication.\nreply"
    },
    {
        "hnuser": "bizzleDawg",
        "date": "2024-07-01T19:40:47",
        "comment": "Neuronostics | Senior Engineer | Python | Bristol, UK (Hybrid) | up-to £85K\nhttps://neuronostics.com is revolutionising neurological disease diagnosis and prognosis through innovative algorithms and software.\nWe're seeking a lead engineer to join our early-stage team and help bring our products to market.\nKey skills: Python, Django, HTMX, postgres, terraform, AWS, full stack development.\nEmail in profile for general questions about the role/company, or application link: https://www.linkedin.com/jobs/view/3927996419\nreply"
    },
    {
        "hnuser": "edward",
        "date": "2024-07-01T21:27:28",
        "comment": "LinkedIn says \"No longer accepting applications\".\nreply"
    },
    {
        "hnuser": "bizzleDawg",
        "date": "2024-07-02T10:13:09",
        "comment": "Thanks for the heads up. There is an email address to send applications to in the posting, and I am getting the applications opened up again. Thanks again!\nreply"
    },
    {
        "hnuser": "brown",
        "date": "2024-07-01T16:48:09",
        "comment": "Medplum (https://www.medplum.com/) | Founding Developer Experience Engineer | SF | Full time\nMedplum (YC S22) is an open source, API first, healthcare developer platform. \"Headless EHR\", we take care of the security, compliance, and regulatory burdens of healthcare software development. Well funded and growing fast.\nWe're hiring an amazing Dev-Ex / Dev-Rel engineer to delight customers, build sample apps, and promote the Medplum platform.\nTech stack: TypeScript, React, Node.js, AWS\nLearn more: https://www.medplum.com/careers/devex-engineer\nreply"
    },
    {
        "hnuser": "tkappel26",
        "date": "2024-07-03T17:09:04",
        "comment": "RealRoots | Founding Engineer/CTO | SF, in-person | https://therealroots.com/\nRealRoots is a mission-driven startup that guarantees women meaningful new friendships in her city. As our Founding Engineer/CTO/Technical Leader, you will be responsible for all technical decisions, direction, and execution. You’ll work directly with both founders to convert our company’s mission into tangible solutions for our end users, building products that are delightful, connecting, scalable, and innovative. We’ve found product-market fit on a small scale through a low-code, operational product, and are now committed to investing in software to accelerate our growth.\nCheck out the JD for more details on this position: https://internal-handsaw-e13.notion.site/Founding-Engineer-C...\nTo apply, email tara@therealroots.com with your resume & a short note about why you're interested.\nreply"
    },
    {
        "hnuser": "przadka",
        "date": "2024-07-03T13:42:53",
        "comment": "Reef Technologies | Senior Python Backend Engineer | REMOTE | Full-time Salary: 45-70 USD per hour, or 7560-11760 USD a month (assuming 40 hours per week). Hourly rates typically adjusted annually.\nWe’re all about the backend! As a fully remote Python software house, we comprise a small, agile team of senior engineers, each with at least five years of experience. We're known for delivering stable solutions and always accounting for edge cases, minimizing the need for urgent fixes.\n- Full Remote Flexibility: Work from anywhere.\n- Flexible Hours: Pick your own hours, with only ~2 calls per week.\n- Dynamic Projects: Work with startups globally on projects of your choice.\n- Influence: Contribute to decisions and influence how we operate.\n- Project Selection: Only accept projects you're interested in.\n- No managers; thanks to the Sociocracy 3.0 framework, everyone's opinion is valued.\n- Personal assistant for your non-work tasks.\n- Multicultural environment with a voice for everyone.\nWho Are We Looking For? Experienced Python engineer with at least 5 years of programming (not necessarily professional), including at least a year with Python. Must have a deep love for Python and the ability to come up with Pythonic solutions to problems.\nHow to Apply: Just go to https://careers.reef.pl/ and see what we’re all about! Do not send us CVs.\nContact: Email: hiring@reef.pl Company Website: https://reef-technologies.com/\nreply"
    },
    {
        "hnuser": "Tom-Farmer",
        "date": "2024-07-03T17:49:24",
        "comment": "Saia Agrobotics | https://www.saia-agrobotics.com/career-full-stack-developer | Fullstack Developer | ONSITE / HYBRID (2 office days a week) | Ede-Wageningen, NL\nWe're in search of a Fullstack Developer to join the Saia Agrobotics team. Our innovative start-up revolutionises the greenhouse sector with state-of-the-art robotics, dramatically reducing labor costs and helping the environment by cutting back on energy, land and water consumption.\nAre you an experienced and passionate software engineer that can help us build the software platform that powers this exciting new technology? This isn't your run-of-the-mill web application; we're combining the latest in web technologies, industrial automation and AI. We need an engineer that loves to learn and with an eye for detail.\nWe're looking for engineers with experience in Rust or a desire to learn and at least 5 years experience in backend development.\nTo apply, email: recruitment@saia-agrobotics.com\nreply"
    },
    {
        "hnuser": "omarelb",
        "date": "2024-07-03T15:22:23",
        "comment": "Attendi | Senior Machine Learning Engineer | Amsterdam, ON-SITE hybrid | Full-time (80-100%)\nHealthcare professionals have to spend too much time on administrative tasks, when they should be spending that time delivering great care. Attendi allows healthcare professionals to report with their voice. This saves them precious time and removes the screen between client and caregiver, allowing more personal and effective care to be given. We provide an extraordinary work environment: getting paid well to work with smart people on things that directly have a positive impact on society.\nHealthcare professionals perform all their administrative tasks in electronic health record (EHR) systems. Attendi (voice) enables EHR vendors' applications by developing speech-to-text and textual understanding APIs.\nAs a Senior ML Research Engineer, you will play a key role in applying the latest AI research findings to our unique datasets, focusing on the end-to-end development and deployment of AI models. You will be at the forefront of translating recent scientific advancements into practical applications within healthcare, with a strong emphasis on privacy and meeting the needs of healthcare professionals. You will be responsible for effectively utilizing our unique dataset of spoken and written medical reports.\nWe have a dedicated team with fewer than 15 members, which means no bullshit, moving fast, and getting a generous slice of equity. We're post product-market fit, profitable, and on the cusp of scaling up in the Dutch market.\nCheck out https://attendi.recruitee.com/o/ml-research-engineer for more details on the position.\nFeel free to send any questions to omar [at] attendi [dot] nl.\nreply"
    },
    {
        "hnuser": "avdot7462",
        "date": "2024-07-02T15:47:59",
        "comment": "Sphinx Defense | Engineering, DevOps, & Product | Remote (US Only), DC, Colorado Springs, LA | https://www.sphinxdefense.com\nSphinx Defense builds software to solve complex national security problems for America and its allies. Founded by engineers and technologists with deep experience across commercial and defense technology, we're building a vehicle-agnostic communication infrastructure to enable satellite operators to securely utilize antenna networks and maneuver satellites in real-time. We're bootstrapped, profitable, and growing aggressively.\nTo learn more about who we are, our engineering culture, and whether this is the right place for you, read our Key Values profile: https://www.keyvalues.com/sphinx-defense\nIn July, we will be posting a few roles: a Backend Engineer, Sr. Backend Engineers, and a DevOps Engineer. Job postings will be up in the coming weeks but apply to the general interest application and list which role you would be interested in : https://jobs.lever.co/sphinxdefense/4e2c340f-3644-40cc-9617-...\nreply"
    },
    {
        "hnuser": "avdot7462",
        "date": "2024-07-03T20:08:27",
        "comment": "Here is the link to our NEW Sr. Backend Engineer posting : https://jobs.lever.co/sphinxdefense/ff9cd434-08a1-4524-a5da-...\nreply"
    },
    {
        "hnuser": "beastawakens",
        "date": "2024-07-01T18:53:53",
        "comment": "Senior Frontend Engineer @ SmileID | https://www.usesmileid.com/ | Full-time & REMOTE\nSmile ID is Africa’s leading digital identity verification, fraud detection, anti-money laundering, and KYC compliance solution for businesses scaling across the continent.\nWe're growing and scaling fast and looking for more talented people to join our team.\nFind out more and apply here: https://wellfound.com/recruit/jobs/2929597\nreply"
    },
    {
        "hnuser": "me_bx",
        "date": "2024-07-02T11:14:07",
        "comment": "Hi,the job offer is not visible publicly, wellfound.com asks for the creation of an account first. Is this on purpose?\nreply"
    },
    {
        "hnuser": "JackC",
        "date": "2024-07-03T13:52:39",
        "comment": "Harvard Library Innovation Lab | Software Engineering Manager | Remote (some US states) or hybrid | Full-Time\nThe Harvard Library Innovation Lab is a software product studio and research lab embedded in the Harvard Law School Library, with a mission of bringing library principles to tech. We build software platforms like Perma.cc and the Caselaw Access Project; publish open source tools for access to knowledge; and host research fellows like Molly White of Web3 Is Going Just Great.\nWe are seeking a Software Engineering Manager to lead a team of six engineers across a range of projects. This position offers a mix of hands on work and leadership, in a relaxed environment, with high ability to set product goals in the public interest. Apply here: https://lil.law.harvard.edu/jobs/#sem\nHarvard eligibility is weird: we can hire hybrid near Cambridge, MA, or remote only if you live in the states of CA, CT, GA, IL, MA, MD, ME, NH, NJ, NY, RI, VA, VT and WA.\nreply"
    },
    {
        "hnuser": "photomatt",
        "date": "2024-07-02T14:47:29",
        "comment": "Automattic | Remote | Full-time | Multiple roles | $110-$210k+ and great benefits\nWe're looking for engineers to help us build, grow, and maintain products used by over a billion people each month across WordPress.com, WooCommerce, WordPress VIP, Jetpack, Tumblr, Beeper & Texts.com, Day One, Pocket Casts, and many more.\nIf you love the open web, open source, radical problem ownership, and simple over pure solutions, Automattic is probably the place for you.\nDid you know that every five years, every Automattician deserves a sabbatical – 3 paid months off! Even I, as a CEO, took mine this year: https://ma.tt/2024/05/sabbatical-wrap/\nProduct-minded Generalist\n  * endlessly curious about how things work – infrastructure, language and libraries, product, and business\n  * solves problems across any level of the stack, in any codebase\n  * comfortable with using mostly PHP and JavaScript, no need to have serious experience with them\n  * apply at https://join.a8c.com/enghn\nSystems Engineer\n  * removes friction between developers and shipping software\n  * owns availability, performance, and security\n  * shares code, experience, and knowledge both internally and externally\n  * apply at https://join.a8c.com/syshn\n…or find something else on https://join.a8c.com/allhn\nreply"
    },
    {
        "hnuser": "seanballais",
        "date": "2024-07-06T14:37:13",
        "comment": "How long should we expect before we receive feedback on the application?\nreply"
    },
    {
        "hnuser": "EGreg",
        "date": "2024-07-08T00:57:41",
        "comment": "Nice! I've been meaning to reach out for a while. Didn't know that photomatt = Matt Mullenweg :)\nOver the last 12 years, I've bootstrapped and built an open source platform to power Web 2.0 (social) and 3.0 (transactional) portals. You can see it at https://intercoin.org/overview.pdf\nMy team and I have long wanted to integrate them with Wordpress. This is our roadmap: https://qbix.com/ecosystem\nI'll reach out and email you tonight. (greg at the domain qbix.com)\nreply"
    },
    {
        "hnuser": "itronitron",
        "date": "2024-07-02T18:23:33",
        "comment": "Given that AI is used as a label for so many different things, can you narrow down what is meant by an interest in 'Applied AI Engineer'?\nreply"
    },
    {
        "hnuser": "mangoparrot",
        "date": "2024-07-02T22:27:59",
        "comment": "\"Product-minded Generalist\". Finally a position I can get behind.\nApplied! :)\nreply"
    },
    {
        "hnuser": "willglass",
        "date": "2024-07-02T06:17:50",
        "comment": "Glass Health (YC W23) | Full-time | Founding Senior Software Engineers (full-stack, backend, LLM, product) | FULLY REMOTE (US or UK time-zones) | $130k-$210k + equity, flexible\nWe build a platform for AI-assisted medical diagnosis and clinical decision-making. Doctors spend twice as much time with computers as they do with patients; our product helps doctors make decisions and draft documentation in seconds. To date, tens of thousands of clinicians have used Glass to generate drafts of differential diagnoses and clinical plans.\nWe went through Y Combinator last year and have raised > $7M (led by Initialized with some of the most brilliant founders in healthtech: Tom Lee, founder of One Medical; Connor Landgraf, founder and CEO of Eko Health; and Heather Hasson and Trina Spear, the co-founders of FIGS. We’ve also been featured in leading clinical lectures like UCSF Grand Rounds and news outlets like NPR and TechCrunch.\nOur CEO/co-founder Dereck is a doctor who studied medicine at UCSF and Brigham and Women's Hospital, and our CTO, Will (me), is a highly experienced engineering leader & successful founder. Join us!\nTech Stack: Django, Typescript, React, Redux, Postgres.\nApply by sending a resume/linkedin to will at glass dot health, or feel free to apply on Lever and mention HN! https://jobs.lever.co/glass-health-inc/\nreply"
    },
    {
        "hnuser": "jpittsvestwell",
        "date": "2024-07-02T18:52:28",
        "comment": "Vestwell | Backend Software Engineers & Product Managers | HYBRID/ONSITE 2x/week | New York, NY | Austin, TX | Phoenix AZ | Full-time\nhttps://www.vestwell.com/careers#jobs\nPlease email me at julia.pitts [at] vestwell [dot] com with your resume as soon as possible if interested:\nVestwell, a series D fintech startup, is hiring for 4+ product and engineering roles. We are now the fastest growing retirement plan recordkeeper with 2,000% growth over the past 3 years and aim to power all payroll-deducted workplace savings programs for businesses, such as the 401(k), 403(b), and IRA.\nPlease view the job descriptions for each role below (https://www.vestwell.com/careers#jobs) and email me at julia.pitts [at] vestwell [dot] com with your resume. All of the following positions are HYBRID meaning you must be less than 2 hours commuting distance from either our New York, NY | Austin, TX | Phoenix AZ office in order to be onsite 2x/week or 2x/every other week (if between 1.5-2 hours away).\nBackend Software Engineer (python) HYBRID - New York, NY | Austin, TX | Phoenix AZ\nStaff Software Engineer (c#) HYBRID - New York, NY | Austin, TX | Phoenix AZ\nSr. Software Engineer (typescript) HYBRID - New York, NY | Austin, TX | Phoenix AZ\nProduct Manager HYBRID - New York, NY | Austin, TX | Phoenix AZ\nSr. Software Engineer (c#) HYBRID - New York, NY | Austin, TX | Phoenix AZ\nreply"
    },
    {
        "hnuser": "lakunle",
        "date": "2024-07-02T20:14:46",
        "comment": "hello, is visa sponsorship available?\nreply"
    },
    {
        "hnuser": "jpittsvestwell",
        "date": "2024-07-03T18:46:17",
        "comment": "Hi, yes we offer visa sponsorship depending on the visa and the role!\nreply"
    },
    {
        "hnuser": "justinyu",
        "date": "2024-07-02T16:04:09",
        "comment": "Counsel (https://www.counsel.health/) | Founding Engineer (full-stack) | Full-time | Onsite in NY (but open to Remote case-by-case)\nHi, I'm the founding engineer here at Counsel.\nCounsel is trying to re-invent how healthcare is delivered by building an AI-first medical practice from the ground up. We believe in a future where patients can get unlimited, instant access to personalized medical advice from real clinicians over text.\nWe're a small team (3 people) but we've already signed contracts with leading healthcare organizations, and we are on track to serve hundreds of thousands of patients on our platform within the next year. We have raised over $10M from top-tier VC firms and angel investors, and are looking for founding engineers to join our team!\nWe're working on some hard engineering and product challenges, including building a best-in-class clinical copilot, a unique patient-facing care platform, and a rebuild of many antiquated healthcare experiences that exist today.\nWe're looking for strong full-stack/ML engineers who love tackling unique engineering and product questions and want to come build the future of AI and healthcare with us.\nMore info: https://www.notion.so/counsel/Founding-Engineer-at-Counsel-8...\nIf interested, reach out to careers@counsel.health, or me directly at justin@counsel.health\nreply"
    },
    {
        "hnuser": "Tao3300",
        "date": "2024-07-02T17:17:03",
        "comment": "> Remote case-by-case\nCan you clarify what case-by-case means?\nreply"
    },
    {
        "hnuser": "sosodev",
        "date": "2024-07-02T18:46:17",
        "comment": "It typically means that they prefer somebody onsite but are willing to do remote for somebody exceptionally qualified.\nreply"
    },
    {
        "hnuser": "Tao3300",
        "date": "2024-07-02T22:55:30",
        "comment": "I doubt that. It would be exceedingly stupid to commute to NY just to share oxygen with their worst employees.\nreply"
    },
    {
        "hnuser": "MigleP",
        "date": "2024-07-04T08:29:30",
        "comment": "NordVPN (Nord Security) | REMOTE in Poland / HYBRID in Warsaw | Full-time | Security Engineers (DevSecOps, Security Architects), Backend Engineers (PHP, Golang), DevOps, Python Engineers, SRE, etc.\nNord Security, the creator of NordVPN, is scaling several of its products - both already established and completely new. We're looking for various professionals in areas of cyber security, backend and frontend development, infrastructure, etc.\nSome positions are available remotely across Poland, while others offer hybrid model in Warsaw and Lithuania.\nCareer page with all the job opportunities: https://nordsecurity.com/careers/jobs\nDon't hesitate to apply or reach out to me directly via LinkedIn @ Miglė Pranckevičiūtė\nreply"
    },
    {
        "hnuser": "mariaufnal",
        "date": "2024-07-02T08:28:41",
        "comment": "Exnaton (Climate Tech) | Delivery Engineer | Remote (EU/EFTA countries) | full-time Exnaton is a startup, spun out of ETH Zurich, which offers software for renewable energy to utility companies. Our software enables energy providers to set up energy communities and smart energy tariffs in their distribution areas. Users of our software can track their energy consumption and buy renewable energy from their neighbors, which makes investing in the energy transition simple and fun!\nRole requirements: - degree in computer science, electrical engineering, statistics, mathematics, physics, engineering, or relevant experience (we are happy to consider applicants without a formal degree if you can demonstrate relevant skills); - a minimum of 2 years of industry experience in software development, IT consulting, or software integration projects; - relevant experience in independently completing complex technical projects; - ideally some experience working with typed API’s (GraphQL, tRPC, OpenAPI) and developing and shipping SaaS web applications with well-abstracted components and composability; - ideally previous experience working on software projects in the energy sector; - motivation to constantly and consistently learn new skills, make quick decisions, and clearly prioritize what moves the needle; - fluency in English, fluency in German would be a big plus; - a team player who thrives in a dynamic startup environment.\nMore information here: https://exnaton-ag.jobs.personio.com/job/1611746?language=en...\nreply"
    },
    {
        "hnuser": "cobalt-io",
        "date": "2024-07-02T16:50:44",
        "comment": "Cobalt.io | Multiple roles | Germany (Remote/Hybrid) | Full-time | https://cobalt.io Cobalt helps secure leading companies (e.g. Dropbox, PagerDuty) by connecting them with on-demand pentesting experts. Our application brings both sides together to identify, triage and fix vulnerabilities. Ten years in and over 30K commits later, our technology has been battle tested by thousands of users and we’re still having fun. We’re a team of can-do people who care about craft, collaboration, and our customers.\nIf you enjoy making an impact, the Cobalt Engineering team is excited to hear from you. We are hiring for multiple roles. All applicants will need to be permitted to work in Germany >>\n+ Senior Data Engineer (AI): https://boards.greenhouse.io/cobaltio/jobs/7460616002\n+ Backend Engineer (Ruby/Rails) : https://boards.greenhouse.io/cobaltio/jobs/7465404002\nreply"
    },
    {
        "hnuser": "3shv",
        "date": "2024-07-02T17:48:36",
        "comment": "Do you offer visa sponsorship?\nreply"
    },
    {
        "hnuser": "nicolaskruchten",
        "date": "2024-07-02T20:55:30",
        "comment": "Hex | Visualization Engineer | Remote - US | https://hex.tech/\nHex is changing the way people work with data. Our platform makes analytics workflows more powerful, collaborative, and shareable. Hex solves key pain points with today's data and analytics tooling, and is loved by thousands of users all over the world for the beautiful UI, new superpowers, and boundless flexibility.\nWe are a tight-knit crew of engineers, designers, and data aficionados. Our roadmap is full of big ideas and little details, and we would love your help bringing them to life.\nHex has raised over $100m from great VCs and angels, giving us many years of runway and the ability to pay competitive salaries, offer great benefits, and provide meaningful equity.\nWe're looking to grow our team with a second full-time Visualization Engineer (in addition to me!) working on no-code tools for visualization. See https://hex.tech/careers/visualization-engineer/ for more details.\nreply"
    },
    {
        "hnuser": "rwparris2",
        "date": "2024-07-02T01:58:52",
        "comment": "Rygen | Senior Software Engineer | Greenville, SC | Onsite | rygen.com\nRygen designs and builds technology solutions to empower the logistics industry. Shippers, carriers, vendors, and 3PLs that join Rygen are able to eliminate painful tasks like shipment tracking, contract management, invoice payments, and other tedious tasks, allowing them to focus on the core parts of their business.\nRygen has a product-focused team that enjoys building out tools that fundamentally move the logistics industry forward. The team is made up of talented individuals from both technology companies and traditional logistics companies.\nWe're looking to add an additional mid level or senior software engineer to the team. https://www.linkedin.com/jobs/view/3924720701/\nWe're also looking to hiring a product manager to help us focus on building the right thing. https://www.linkedin.com/jobs/view/3924725325/\nThese are ONSITE positions, you will be expected to be in the office 2-3 days a week.\nIf you're interested, apply via LinkedIn or send your resume to rparris at rygen.com with 'HN' in the subject.\nreply"
    },
    {
        "hnuser": "lakunle",
        "date": "2024-07-02T20:47:13",
        "comment": "Do you offer visa sponsorship?\nreply"
    },
    {
        "hnuser": "debuggest",
        "date": "2024-07-04T00:10:01",
        "comment": "Olo | Remote (US) (HQ in NYC) | Full-Time | https://www.olo.com/\nOlo is a leading on-demand commerce platform powering the restaurant industry’s digital transformation. Our customers include many of the largest restaurant brands in the US, and we have a lot of exciting projects in the works.\nWe're hiring for multiple remote (US-based) roles in engineering and other departments. Engineering roles include Senior Machine Learning Engineer, Security Engineering Manager, Full-Stack Engineer, and Distributed Systems Engineer.\nhttps://jobs.lever.co/olo?lever-via=WSee4m3bRz&lever-social=...\nSalary info included on all job listings and great benefits!\nreply"
    },
    {
        "hnuser": "tandemwork",
        "date": "2024-07-01T18:26:18",
        "comment": "Tandem | Founding Software Engineer | Remote | Full-time | $120k – $180k • 0.25% – 0.75%\nTandem is reimagining the employer-employee relationship by making employer-sponsored training accessible to any employer with the imperative to grow.\nRole: As a Founding Software Engineer, you'll shape our platform's tech backbone and drive technical direction. You'll influence a high-impact startup from the ground up, contributing to strategic decisions and hands-on coding.\nResponsibilities: - Develop scalable software solutions across our full stack - Participate in all software development lifecycle phases - Help define and execute technical roadmap - Develop and maintain dev processes, tools, and workflows\nRequirements: - 3+ years full stack experience, focus on scalable web apps - Strong Python skills, familiarity with Python backend frameworks - Proficiency in modern frontend frameworks (React/Next.js preferred) - Cloud services experience (AWS, GCP, Azure) - DevOps proficiency (Docker, CI/CD, monitoring) - Unix and command-line familiarity - Fintech vendor experience a plus (Stripe, Plaid, ledgers)\nTech Stack: Python (Flask), Typescript (Vue.js / Next.js / React), MongoDB, PostgreSQL, AWS EC2 + Vercel\nWe offer: - Competitive salary and stock options - Comprehensive health benefits - Flexible time off - New computer hardware\nApply: https://wellfound.com/l/2AmvM4\nreply"
    },
    {
        "hnuser": "tarruda",
        "date": "2024-07-02T13:38:30",
        "comment": "I suggest changing \"Remote\" to \"US Remote\", as it is not possible to apply when working outside of the US\nreply"
    },
    {
        "hnuser": "mangecoeur",
        "date": "2024-07-01T17:32:56",
        "comment": "Company: Planeto (early stage cleantech startup)\nPlaneto develops next generation software for design and operation of clean district heating and cooling networks, to accelerate adoption of renewable energies for zero emissions cities.\nHiring a Senior Software Engineer, REMOTE (EU/UK/CH, head office in Geneva, Switzerland)\nhttps://cord.co/u/planeto-/jobs/125274-senior-software-engin...\nreply"
    },
    {
        "hnuser": "viv-labdigital",
        "date": "2024-07-03T09:51:11",
        "comment": "Lab Digital | Utrecht, The Netherlands | DevOps & Software Engineer | Part-time / Full-time (32-36-40h p/w) | Hybrid (2 days in office) | https://www.labdigital.nl\nLab Digital is a digital agency where 85+ professionals work in 4 multi disciplinary teams for national and international clients. E-commerce, b2b, b2c, as long as we can ensure a great user experience. We work with AWS, Azure and GCP, but are mostly looking for Azure and GCP experience for the DevOps role to complement our DevOps team. Other technologies are mainly TypeScript, React, NodeJS, Python for software engineer roles. We value knowledge sharing (open source), culture and a people centred approach. The first interview is always about who you are as a person and if we are the right organisation and culture for you.\nUnfortunately, we can't sponsor visa's right now. View our vacancies here: https://careers.labdigital.nl and specifically DevOps: https://careers.labdigital.nl/devops-cloud-engineer-2/en or back-end (TypeScript/NodeJS): https://careers.labdigital.nl/backend-software-engineer-type...\nApply via the form in the vacancies.\nRead more about our expertise here: https://www.labdigital.nl/expertise/ Or view our Github: https://github.com/labd/ Or our open source platform: https://www.machcomposer.io\nreply"
    },
    {
        "hnuser": "bihla",
        "date": "2024-07-01T22:18:53",
        "comment": "Numeric | Software engineer (4+ YOE) | ONSITE in San Francisco, CA | https://www.numeric.io\nWe're building the platform to automate accounting and tackle the underlying data issues which plague accounting and finance departments. Customers like Plaid, Wealthfront, AngelList, Mercury, and more depend on Numeric to automate their work, to collaborate, and to monitor, analyze, and share insights on their financial data. We've raised $10M to date from excellent investors like Founders Fund, Menlo Ventures, and more.\nWe're a product-first company with technical founders and an engineering team whose past experiences include Brex, Segment, Carta, and more. This will be a fit if you're excited to understand your users and the domain, as well as to have substantial responsibility and impact. We work in person in our SF & NYC offices, and prioritize speed and ownership (both technical and product ownership). We're growing rapidly, we're well-funded, and building out our team to continue investing in ambitious product goals.\nProduct-oriented engineers appreciated, bonus points for startup experience and/or full-stack experience with Typescript. >=3 YOE.\nApply: Email andrew@numeric.io (mention hackernews in subject)\nreply"
    },
    {
        "hnuser": "gurchik",
        "date": "2024-07-02T00:39:34",
        "comment": "Propel | Senior Platform/DevOps Engineer | Remote (US) | Full-time | $150k-$230k\nPropel is on a mission to empower low-income Americans by simplifying access to government benefits with modern technology. All of our users deserve first-class experiences in their daily interactions with the social safety net and financial services. We're a passionate team of 100 Propellers - all working to help our users get through the month, every month. We’re looking for a self-motivated Platform Engineer to join our Infrastructure Team within the engineering org at Propel.\nYou will own our fundamental cloud services that our engineering team builds upon, our application platform (based on Kubernetes) that we run our applications on, and own our developer experience and tools.\nTech stack: AWS, Kubernetes, Jenkins, Terraform, Datadog\nThis position is fully remote, but offices are available in Brooklyn, San Francisco, or Salt Lake City if desired. Location does not affect compensation, but unfortunately we are only accepting applications from residents in specific US states at this time. Please see the job post for the complete details.\nhttps://boards.greenhouse.io/propel/jobs/7445950002\nreply"
    },
    {
        "hnuser": "AnhTho_FR",
        "date": "2024-07-01T20:29:20",
        "comment": "Lago | Data Scientist | European Union | full-time | REMOTE or in-person in Paris, France | https://www.getlago.com/\nLago is the leading open-source usage based billing API and is serving companies such as Mistral.ai, Groq, Together. We’re backed by YC, FirstMark Capital, Clement Delangue (Hugging Face), Romain Huet (OpenAI).\nWe’re looking for our first Data Scientist, to leverage the usage/consumption/payment data we produce and build data-oriented features for our customers.\nWe can sponsor visas in France. If you live in another country in the European Union, we’re open to it (as long as the timezone is +2/-2h from Paris) but unfortunately cannot sponsor the visa.\nGithub: https://github.com/getlago/lago\nTechcrunch: https://techcrunch.com/2024/03/14/lago-a-paris-based-open-so...\nJob description: https://www.ycombinator.com/companies/lago/jobs/O7dCOie-data...\nContact: talent [at] getlago.com\nreply"
    },
    {
        "hnuser": "mglidden11",
        "date": "2024-07-01T23:42:25",
        "comment": "Tulip | https://tulip.co/eng | Boston, MA, Munich, Germany, and Budapest, Hungary | Full time | Onsite\nTulip is transforming manufacturing. Our customers use Tulip to create apps without code and to connect their apps to machines, sensors and smart tools. Each process is different, and every shop floor is filled with exciting challenges, technological and otherwise. Tulip’s no-code app editor lets customers build custom apps to their specific use case. You’ll contribute to software used to make gigantic CNC mills, high-end pharmaceuticals, jewelry, PCBs, and more.\nOur team prizes intellectual generosity, collaboration, and deep ownership. We appreciate teammates from different backgrounds and experiences, and in particular we are looking to bring folks in on:\nHead of Product Management: lead the Tulip Product Management team and work across product and engineering to identify areas of growth and scale for our existing products and beyond\nAnalytics, Team Lead: lead and grow a team owning the interface used to collect, analyze and build data dashboards with high fidelity and contextualization\nBuild, UI Lead: translate design systems to code, partnering with both sides of the product-engineering coin to steer our frontend guild\nDevX, Engineer: make it easier for developers to write better code faster, by creating the tooling they wish they had time to write\nApply at https://tulip.co/careers or email us at “jobs [at] tulip [dot] co” if you want to learn more\nreply"
    },
    {
        "hnuser": "MeaningfulAI",
        "date": "2024-07-01T15:03:35",
        "comment": "Meaningful Gigs | REMOTE (US based) | Full-time | Founding/Sr. ML Engineer | Senior Backend Engineer | Senior Frontend Engineer\nMeaningful Gigs began as a marketplace for creative talent & evolved to build AI-driven creative workflows. We are on a mission to advance human creativity by eliminating mundane tasks that stifle innovation and transform the $162 billion creative market.\nHelp us shape the future of creativity by quietly rolling out a new product, separate from our creative marketplace, which helps speed up creative tasks, think ‘Grammarly for creative workflows’. We have various AI powered features that automate repetitive creative tasks.\nWe are an innovative and fast-moving, seed-stage startup of 16 people, (10 in product) prepping for our Series-A and growing quickly.\nTech Stack: Javascript/Typescript, React, NodeJS, AWS SDK, Serverless, Express ML: Python, Tensorflow, Pytorch, Scikit-learn Check out our open positions at: https://boards.greenhouse.io/meaningfulgigs Contact our Head of Talent directly at Christina(at)meaningfulgigs.com or on LI: https://www.linkedin.com/in/christina-kayler/\nreply"
    },
    {
        "hnuser": "quarok",
        "date": "2024-07-02T08:06:59",
        "comment": "Gizmo | Software Engineers | London | Hybrid | https://gizmo.ai\nGizmo is a startup on a mission to make learning so easy and fun that anyone can learn anything. We're aiming to help 1 billion people learn by building Duolingo for Anything - a fun gamified way of learning anything!\nWe’re an early stage well-funded startup that's grown 11X in the last year. We're run by a former Google marketer & Amazon machine learning researcher, a former teacher, and a database specialist who became best friends while studying at Cambridge University. You'd be one of our first hires and an incredibly important part of the team.\nApply for backend (https://apply.workable.com/gizmo/j/1E47C074B1/ or frontend roles (https://apply.workable.com/gizmo/j/8CEB76AEBD/) or just email robin [at] gizmo.ai with a CV\nreply"
    },
    {
        "hnuser": "espinchi",
        "date": "2024-07-01T21:42:56",
        "comment": "Aleph | REMOTE PT - ET Hours | Software Engineer, Eng Manager, AE | https://www.getaleph.com\nAleph is redefining the world of Financial Planning & Analysis (FP&A). We operate in a well-defined software category with a multi-billion TAM yet a lack of a clear winner. We’re here to change that, and our early results speak for themselves.\nWe’re backed by top VCs (Bain Capital Ventures, Khosla Ventures, YC, Picus Capital), and work with customers like Eight Sleep, Webflow, Turo, Notion, and others.\nWhat we’ve built so far is the most seamless way to centralize all of a company's financial data – think expenses from Quickbooks or Netsuite, pipeline forecasts from Salesforce – and bring it into the tools finance teams are already using. But the vision goes way beyond that. We’re building the source of truth for a business’ data, and ultimately the platform businesses use to make better decisions.\nWe’re way ahead of schedule due to our unique approach, with pretty much no churn, and rapid growth despite no marketing spend to date.\nSee more details and apply via https://www.getaleph.com/careers?utm_source=hn\nreply"
    },
    {
        "hnuser": "hmefford1244",
        "date": "2024-07-02T03:22:44",
        "comment": "Job Summary: Artificial Intelligence Engineer\nCompany: Advanced Recovery Systems Location: Florida, United States Job Type: Full-time, Mid-Senior level, On-site or Remote/Hybrid Flexible\nThe Senior Software Developer, AI, will play a critical role in the development and integration of AI products, with responsibilities in both front-end and back-end development. Key tasks include system integrations, API development, assistant system prompt engineering, multimodal LLM integration, UI/UX design, and creating robust back-end services.\nKey Responsibilities:\n• AI Product Development: Contribute to the development of AI projects that advance healthcare technology. • System Integration: Work on integrating various systems and developing APIs. • UI/UX Design: Enhance user interfaces and experiences for AI products. • Multimodal LLM Integration: Implement large language models in AI applications. • Collaboration: Work in a collaborative environment that values innovation and teamwork.\nWhy Join ARS?\n• Impactful Work: Contribute to a mission-driven organization that positively impacts patient care and efficiency. • Innovative Environment: Engage in cutting-edge AI projects.\nContact: hmefford@advancedrecoverysystems.com\nreply"
    },
    {
        "hnuser": "Gboe123",
        "date": "2024-07-05T14:35:35",
        "comment": "We are hiring for a bunch of data engineering roles (operations, data engineer, Team Lead, NLP roles, and a Head of Engineering at https://okra.ai/careers/ in Leiden the Netherlands. We provide relocation and for those who need visa sponsorship, we can entertain those if the match is great.\nWith our AI solution on our SaaS platform, we help to bring medicines & treatments faster into the hands of patients. We combine private data from pharma companies and publicly available data.\nData Engineer Individual Contributors (All seniorities) https://careers.envisionpharmagroup.com/jobs/vacancy/data-en...\nData Engineering team lead https://careers.envisionpharmagroup.com/jobs/vacancy/data-en...\nDevOps Engineer https://careers.envisionpharmagroup.com/jobs/vacancy/devops-...\nHead of Engineering https://careers.envisionpharmagroup.com/jobs/vacancy/head-of...\nNLP Data Scientist https://careers.envisionpharmagroup.com/jobs/vacancy/nlp-dat...\nIf you apply on the website directly, we will get back ASAP\nreach out to me on LinkedIn for further questions https://www.linkedin.com/in/gurbescheenstra/\nreply"
    },
    {
        "hnuser": "dseisenberg",
        "date": "2024-07-01T21:36:25",
        "comment": "Hashboard (https://hashboard.com) | New York (NYC) | Senior/Staff Full-Stack Engineer, Lead Frontend Engineer, Product Evangelist | Onsite\nHashboard is a business intelligence and analytics platform that bridges self-service data exploration with modern development workflows.\nWe are a well-funded, ambitious seed-stage New York City startup backed by top-tier product and data investors. Our team has experience as early employees of successful startups and in big tech. We have early product-market fit and a growing list of paying customers, and we’re looking to build a diverse and thriving team. And we might be a great fit for the next step in your career if you’re excited about having a lot of ownership over your work, learning from customers and investors, building a world-class engineering culture, and holding a lot of equity in a fast-growing startup.\nWe're especially on the lookout for product-oriented engineers with strong React skills and experience with data tooling.\nApply here: https://jobs.ashbyhq.com/hashboard or email me directly at dan (at) hashboard.com\nreply"
    },
    {
        "hnuser": "andrewk17",
        "date": "2024-07-01T16:08:18",
        "comment": "Bonside | Senior Full Stack Engineer | New York City (NYC) | Onsite few days a week | https://bonside.com/\nBonside is an NYC-based fintech startup providing financing to brick-and-mortar businesses (https://techcrunch.com/2023/06/07/bonside-growth-capital-bri...). We are looking to hire an experienced full-stack engineer to join as a founding member. Bonside has already deployed over 5 million dollars to brick-and-mortars in less than a year and is on track to more than double that in the coming months.\nThe team is currently 8 people and focused on hiring curious, ambitious, and thoughtful teammates. This opportunity presents a strong growth trajectory for a skilled engineer who will be instrumental in building delightful software, the architecting of systems, and the scaling of the engineering team. The company is at an exciting inflection point with a variety of interesting engineering challenges that include data engineering, an investment marketplace, and brick-and-mortar specific software. This role will work closely with our Head of Engineering (prev. Netflix).\nFull job description: https://wellfound.com/l/2zfn1v\nTech Stack: Typescript, NextJS, tRPC, Tailwind, Node, Python, Prisma, Postgres, Vercel, Supabase, Retool, ClickHouse, Metabase\nFeel free to apply on the site or email me at andrew@bonside.com\nreply"
    },
    {
        "hnuser": "jianga",
        "date": "2024-07-03T21:32:09",
        "comment": "Carbon | Senior Fullstack Engineer | HYBRID/ONSITE 2x/week | Redwood City, Bay Area CA | $152K - $229K | https://www.carbon3d.com/\nCarbon is a 3D printing late-stage startup focused on bringing ideas and designs into production. We are looking for a fullstack engineer who can help us build our design, 3D print preparation, and workflow automation software. We work in TypeScript, React, three.js, Node.js, Nest.js, and PostgreSQL.\nApply here: https://boards.greenhouse.io/carbon/jobs/4360849007\nQuestions? Email me: jianga at carbon3d dot com\nreply"
    },
    {
        "hnuser": "justicz",
        "date": "2024-07-01T18:47:41",
        "comment": "Charge Robotics | Senior Software Engineer (Full-Stack) | Full-time | Onsite / Hybrid | SF Bay Area\nHi HN! We’re a YC-backed startup building robots that build large-scale solar farms. We just got back from the first commercial deployment of our system on a real-world solar construction site.\nCheck out a video of our system here! https://youtu.be/ZZ2fP1Y5Z2E\nIt turns out that construction companies literally can't build solar fast enough, so what we're doing is a crucial part of switching the grid over to renewable generation. We're looking to bring another talented full-stack software engineer onto our small team.\nYou’ll be a key contributor, helping bring our next generation of mobile solar factories to life. Your work will involve architecting, developing, and maintaining high-quality code and documentation for a web application that controls our fleet of fully-automated factories\nCome work with us if you love:\n* Greenfield web application development\n* Making a positive climate impact through your work\n* Hacking on massive construction equipment!\nApply here: https://www.workatastartup.com/jobs/67459\nreply"
    },
    {
        "hnuser": "AaronNewcomer",
        "date": "2024-07-01T16:20:04",
        "comment": "Kajabi | Data Engineer Lead | REMOTE\nI'm Aaron, leading the data team at Kajabi, a leading all-in-one platform for knowledge entrepreneurs to build, market, and sell educational content, communities, newsletters, and other digital products. We have helped entrepreneurs generate over $7 billion in sales from over 85 million customers to date.\nRole: Data Engineer Lead\nLocation: Remote (USA)\nWhat You’ll Do: • Shape our data strategy and develop robust data models. • Build and optimize data pipelines. • Enhance analytics and ensure data quality. • Collaborate with a dynamic and cross-functional team.\nWhat We’re Looking For: • 5+ years in a data engineering lead role. • Proven experience with data pipelines, data models, and data governance. • Strong SQL skills and proficiency with dbt and Snowflake. • Experience with event-driven architectures and analytics databases (e.g., Apache Druid, ClickHouse).\nPerks: • Fully paid medical, dental, and vision insurance. • Flexible vacation policy and telecommuting. • 401K with 100% match up to 6%. • Fitness incentives and wellness perks.\nIf you’re passionate about data modeling and creating impactful metrics, we want to hear from you.\nApply here: https://kajabi.com/company/careers\nreply"
    },
    {
        "hnuser": "tyre",
        "date": "2024-07-01T16:04:07",
        "comment": "Juniper (YC W21) | Senior Software Engineer, Data Engineer | NYC | Full-time | juniperplatform.com\nJuniper operates at the messy financial infrastructure layer for US Healthcare. We’ve built an end-to-end insurance billing system for recurring care, starting with Autism clinics. Healthcare in the United States runs on private and public insurance billing, but providers spend huge amounts of time on faxes, phone calls, and error-prone legacy systems to get paid. That’s not why they got into care.\nWhat’s worse, these systems aren’t hugely successful—clinics regularly get back 80% what they know the insurance company should pay. Those missing dollars could be used to hire more care providers to help more kids, but instead line insurance companies’ pockets.\nWe’re changing that.\nAt Juniper, we’ve built an end-to-end billing system. It starts with ingesting from a clinic’s EHR, then create, validates, and submits claims to insurance providers across the country. If claims need corrections or appeals, most of the time we can handle those automatically or our CX and Operations team use our in-house internal tools. We also handle patient invoicing for co-pays, co-insurance, and deductibles (we never send anything to collections.)\nOur typical paid rate is above 95%.\nWe are a team of 25 with strong product market fit—we’ve had to push out onboardings because engineering can’t build quickly enough.\nYou’ll be working with an engineering leadership team from AWS and Stripe to get doctors and clinicians back to work helping kids.\nInterested in fixing American healthcare? Email josh.paul@juniperplatform.com to chat\nreply"
    },
    {
        "hnuser": "getrecharge",
        "date": "2024-07-01T18:18:49",
        "comment": "Recharge | Engineering, DevOps | REMOTE | Full-time | https://getrecharge.com/\nRecharge is an e-commerce and subscription management platform that powers the growth and retention strategies of more than 20,000 brands serving over 100 million subscribers. We're looking to expand some of our primarily backend engineering teams to support new feature development and product reliability.\nTech stack: Python, Flask, MySQL, Redis, Elasticsearch, React, Vue, GCP, Kubernetes, etc.\nWe're hiring:\n- Senior DevOps Engineer: https://grnh.se/431b341b2us\n- Senior Backend Engineer (Core Commerce): https://grnh.se/f265a47c2us\n- Senior Software Engineer (Merchant Experience): https://grnh.se/d9fbc82f2us\nThe above are all referral links for current jobs, but you can also see a full list of jobs and apply online at https://getrecharge.com/careers/\nreply"
    },
    {
        "hnuser": "guiocm",
        "date": "2024-07-01T23:05:34",
        "comment": "Are these positions US / Canada only?\nreply"
    },
    {
        "hnuser": "wyclif",
        "date": "2024-07-02T01:27:16",
        "comment": ""
    },
    {
        "hnuser": "",
        "date": "2024-07-02T03:02:02",
        "comment": ""
    },
    {
        "hnuser": "Andrewjardine",
        "date": "2024-07-05T17:08:00",
        "comment": "Adaptive ML ($20m Seed)| ML Developer Advocate | NYC/Paris/Remote | Visa sponsorship available | https://www.adaptive-ml.com/\nAdaptive ML has built an LLM platform that democratizes access to frontier alignment techniques (incl. reinforcement learning) so business can surpass frontier model performance using smaller open models adapted with user feedback for their task. The company was founded by the engineers behind Falcon 40B and 180B, and is backed by top VCs Index and Iconiq.\nWe've looking for a ML Developer Advocate that loves educating their audience on technical concepts, can evangelize the efforts of our science team and likes getting their hands dirty hacking together fun example notebooks. If this sounds like you, please apply.\nApply here --> https://www.adaptive-ml.com/open-positions/developer-advocat...\nreply"
    },
    {
        "hnuser": "bnc319",
        "date": "2024-07-01T18:06:31",
        "comment": "CAPP | https://capp.net | Greater Philadelphia / Remote | full-time | Data Wrangler | $70-90K starting + benefits\n  CAPP is a leading industrial distributor. Our team is looking for an additional hire to work on a myriad of pricing and data tasks. We are currently sprinting the processing of manufacturer and vendor product data and pricing, in order to expand our eCommerce offerings and enable all of our product lines to be offered for sale digitally. We have built out tools that use Python and other libraries to help automate data inflow and processing. We run a legacy ERP platform and are in the midst of a major migration to a new platform with powerful eCommerce capability slated for the late summer. Over time, there is tons of opportunity for advancement and growth based on merit. If you are interested in working for a stable company with a startup-like technology team where your changes directly impact business growth and customer satisfaction, we'd like to hear from you.\n  \n  Send an email to careers@cappusa.com and reference this post. Thank you.\nreply"
    },
    {
        "hnuser": "niall00c",
        "date": "2024-07-01T15:28:55",
        "comment": "Matterworks.ai | Software & Data Engineering | Hybrid (Boston/Somerville MA) At Matterworks we are building AI tools to extract insights from the ever-growing corpora of biological data and to unlock opportunities in therapeutic discovery, development, and manufacturing. We are building large-scale deep learning models of biological data to predict the phenotype and behavior of biological systems.\nThroughout the interview process you can expect the following during your time with us: - Phone call to review with hiring manager - Virtual pairing interview (system architecture and design) - Hopefully a quick decision and offer!\nPrincipal Software Engineer, Full Stack - https://jobs.lever.co/matterworks/94bec32b-7dfc-4307-9338-ce...\nPrincipal Data Engineer - https://jobs.lever.co/matterworks/ed4cdf51-7e5d-4a0f-9d42-b5...\nreply"
    },
    {
        "hnuser": "boltzmann-brain",
        "date": "2024-07-02T05:23:56",
        "comment": "I've got massive experience doing exactly what's in your job spec, are you able to hire remotely from EU?\nreply"
    },
    {
        "hnuser": "danieloneel",
        "date": "2024-07-01T17:11:39",
        "comment": "Layer | Founding Front End & Fullstack Eng | San Francisco In-Person | Full-Time\nWe’re building SMB accounting software API-first so that it can be integrated directly into software platforms where business owners already work. Our customers are vertical software platforms in the vein of Toast, MindBody or Housecall Pro that help small business owners start, run and scale their business with workflows and financial products. We help them serve their customers who are stuck exporting all their data out of these systems into CSVs and importing it back into other accounting software.\nIntegrating with our accounting APIs gives business owners automation & accounting workflows directly within their core software while the software platforms get to solve one their customers’ biggest pain points: worrying about bookkeeping & finances.\nWe’re looking for a founding frontend engineer who is excited about building a company and team as well as building better software for SMBs. We have no standalone frontend - instead we build a React component library that our customers can directly use within their own apps: https://www.npmjs.com/package/@layerfi/components\nWe are well funded by top tier investors and are live with hundreds of small businesses. If you’re passionate about building software that real small businesses use every day, get in touch with me at daniel [at] layerfi.com\nMore about the role and team here: https://jobs.ashbyhq.com/layerfi/ef55941f-b59c-419a-8736-a25...\nreply"
    },
    {
        "hnuser": "timjulien",
        "date": "2024-07-01T19:46:04",
        "comment": "Radar Labs | Software Engineers (backend, full-stack, mobile) | ONSITE in New York City | Full Time | https://radar.com\n- Radar Labs is the location infra dev tool.\n- Doing 1B+ API calls per day\n- Our main languages are Rust and TypeScript, and we also use mobile and offline pipeline languages (Python, Scala, and Terraform).\n- We're based in NYC with our HQ in Union Square.\nInteresting things we're working on:\n- HorizonDB, our Geospatial database written in Rust\n- Precise indoor location more accurate than iOS and Android leveraging sensors on the device and ML models\n- Mobile infrastructure that automatically configures itself optimizing battery-life and location accuracy for different use-cases over time\n- Frontend tools to visualize and debug location data at scale\nWhat you'll do:\n- Work on core Radar infrastructure (mobile, backend, full-stack)\n- Have your work run on 100's of millions of devices\n- Talk to Radar customers and prospects, hear their feedback, incorporate it into your work and make them successful\nCheck out our jobs page here: https://radar.com/jobs#jobs\nIf you have any questions, feel free to reply here or you can e-mail me at tim@radar.com\nreply"
    },
    {
        "hnuser": "stock4hire",
        "date": "2024-07-02T16:58:58",
        "comment": "Sirona Medical | Remote from CA, WA, OR, NV only | Radiology AI platform | Software Engineering\nSirona Medical is actively interviewing and hiring multiple Backend Engineers with production level proficiency with Python, multiple Frontend Engineers with expertise with React and two DevOps/Infrastructure engineers with proficiency with a wide array of cloud services across AWS and Kubernetes.\nSirona is a 65 person company with a team of 30 highly skilled, kind and talented engineers. If you're looking to make an impact while working with an engaged, mission driven team, let's talk.\nOur open roles are listed here: https://sironamedical.com/join/\nQuestions? greg.stock@sironamedical.com https://www.linkedin.com/in/gregstock/\nreply"
    },
    {
        "hnuser": "ydant",
        "date": "2024-07-02T17:56:18",
        "comment": "Your \"join\" page is a little UX uncomfortable. Middle click doesn't work for the description or apply link (just loads the whole join page again), and the apply expands/embeds the greenhouse.io page (in a narrow column) instead of opening it in a new window.\nreply"
    },
    {
        "hnuser": "rbruggem",
        "date": "2024-07-01T15:43:41",
        "comment": "Lune | Software Engineers, Sales | London or REMOTE (London +/- 2 hours) | Full-Time | https://lune.co\nLune’s mission is to make every product and service climate-positive by default.\nWith the Lune API, we enable companies to seamlessly build emissions calculations and high-quality carbon removal into their product and services and make it part of the customer experience. In the future, everything we do will have a positive impact on the planet – powered by Lune.\nIf you’re a talented engineer or sales professional who learns quickly and cares about tackling the climate crisis, we’d love to work with you!\nThese roles are a unique opportunity to be part of Lune’s core team, to have a real impact on our mission, and to define and scale the company into the future.\nAs we grow, you’ll have the opportunity to take on new responsibilities and help build a great company while tackling the greatest challenge of our time.\nInterested?\nTech stack: TypeScript, React, Nextjs, AWS, PostgreSQL, Terraform, Kubernetes.\nHiring for:\n- Senior \"bar raisers\" Frontend Software Engineers\n- Account executive - logistics\nhttps://lune.co/join-us\nreply"
    },
    {
        "hnuser": "html5cat",
        "date": "2024-07-02T04:27:41",
        "comment": "Puma.tech | Remote-first with PST overlap | Engineering & Growth | $75-150k base & 200k+ equity | https://puma.tech\nHi all, I’m Yuriy, founder of Puma.tech. Previously worked as software engineer & developer advocate at Cloudant (YC S08, Acq. by IBM), Meteor (YC S11), Parse (YC S11, Acq. by Meta), and explored Ai/ML (computer vision for self-driving cars) before diving deep into crypto.\nPuma Browser is focused on making LLMs easy to use on your mobile phone. Private by design.\nHere’s a quick demo we posted recently: https://x.com/PumaBrowser/status/1797072415388033393\nWe’ve raised Angel and Pre-Seed Rounds from some of the best builders in crypto and Ai: Illia Polosukhin (NEAR Protocol), Sridhar Ramaswamy (Snowflake CEO, Neeva, Greylock), Jason Warner (ex-GitHub CTO), Chris Larsen (founder of Ripple), Don Ho (Orange DAO, Quantstamp), Protocol Labs, Shima, SBI, Fenbushi, HashKey and more.\n- We value Optimism, Kindness, Curiosity, Speed and Grit.\n- Only two recurring weekly meetings to maximize state of flow: Monday all-hands, Friday Demos.\n- Careful with growth and never had to do layoffs.\n- Capital efficient with 3+ years of runway.\nOpen Roles: Eng (iOS, Android, Ai/ML, Browser Extensions), Based Social Media Intern; Internships: Eng, Design, Growth\nHow to Apply: visit https://puma.tech or email careers+hn [at] puma.tech with your GitHub, a note on what you're most proud of building and what you'd like to build next.\nThank you!\nreply"
    },
    {
        "hnuser": "brian-viz",
        "date": "2024-07-01T22:37:26",
        "comment": "Viz.ai | Solutions / DevOps Engineer | FULL REMOTE US ONLY, NO VISA SPONSORING | Full-time | https://viz.ai/\nWe are a later stage startup and are a pioneer in the use of clinically backed AI algorithms and machine learning to increase the speed of diagnosis and care across 1,500+ hospitals and health systems in the U.S. and Europe.\nWe're looking for someone with experience in containerization, Kubernetes or similar orchestration tools, and deploying services at the edge in HIPAA-compliant and highly secure environments. Familiarity with immutable operating systems and tools like Kairos is a plus. We're primarily a Python shop, and we're looking for a strong contributor to join our small team and tackle unique problems.\nPlease email brian <at> viz <dot> ai or mention hackernews in your application here: https://www.viz.ai/jobs?gh_jid=7442634002\nreply"
    },
    {
        "hnuser": "jvrossb",
        "date": "2024-07-01T16:27:20",
        "comment": "Taiyaki Studios | Anime Pipeline Engineer | Tokyo | On-site Full Time | Will Sponsor Visa\nWe’re building new pipelines for anime production. Join us and empower animators to focus on the fulfilling stuff - story, character design, art direction, cinematography - and take the grunt work off their plate.\nOur tools are being used to produce original content in-house, so you’ll get to work directly with animators and help make anime!\nIdeal candidate: nimble problem solver, comfortable learning how to build tools that integrate with existing industry-standard software, even if you’ve never used said software before. We value fast learners who are language agnostic.\nBonus: Python, ComfyUI experience.\nJapanese proficiency not required, though nice to have. We’ll pay for weekly lessons if you want them.\nIf you need visa sponsorship, you’ll need a bachelor’s or 10 years experience. Not our requirement, gov’t requirement. We’ll help with all relocation logistics.\nWe pay 20M JPY/yr (~$125k/yr) + equity, 3-4X median salary in Tokyo, you’ll live in luxury or save a good chunk of your salary.\nWhat have you shipped, tinkered with, or hacked together? Let us know: careers@taiyakistudios.com\nreply"
    },
    {
        "hnuser": "stevefrdnt",
        "date": "2024-07-02T04:53:57",
        "comment": "Hi, I'm interested in the opportunity. I already sent an email, and I'm wondering if there are any social media or platforms that I can get in contact with to ask some questions and maybe learn more details about the position.\nreply"
    },
    {
        "hnuser": "startages",
        "date": "2024-07-02T16:22:38",
        "comment": "Hello, I've sent you an email, I'm really interested in this job. Would also love to learn Japanese as a language.\nreply"
    },
    {
        "hnuser": "comfyexpert",
        "date": "2024-07-03T21:09:54",
        "comment": "this pay is way too low for a job that is effectively automating out inbetweeners. I have python experience and extensive ComfyUI experience. I will not be applying.\nreply"
    },
    {
        "hnuser": "hbagdi",
        "date": "2024-07-01T21:44:17",
        "comment": "Kong | Bengaluru, India | Onsite/Hybrid | Full-time\nWe recently opened an office in Church Street in Bengaluru and are expanding rapidly. We are looking for Software, SRE/DevOps, Data engineers and Frontend engineers. A few exciting roles:\n- Run tens of thousands of Kong gateway clusters for our customers: https://jobs.lever.co/kong/638a1cda-b006-4fdc-a089-6339e48bb...\n- Build the platform that powers our Konnect, our SaaS cloud: https://jobs.lever.co/kong/d0ff6704-6924-49ed-9526-4f1e6a1b2...\n- Work on state-of-the-art data platform: https://jobs.lever.co/kong/9c8d3182-29c2-421a-b77c-e4b18268a...\nPlease reach out via email to harry at domain of my company for any further questions.\nreply"
    },
    {
        "hnuser": "bgrgndzz",
        "date": "2024-07-01T17:32:18",
        "comment": "HockeyStack | Cracked Backend/Infra Engineer | ONSITE (San Francisco) | VISA sponsorship available | $180k-$250k + 0.2-0.4% stock option\nHockeyStack is creating a single source of truth and reporting for marketing, sales, and all customer data.\nWe came out of YC S23, and raised $4.3M from General Catalyst, Madrona, et al.\nWe went from 0 to millions in ARR in a really short time and are in a DEEPLY URGENT need of really good engineers to help scale infra and backend.\nThe product collects data from CRM, marketing automation, ad platforms and data warehouses. The data then gets cleaned and transformed into a unified format. Out of the unified data format, customers can create any type of report the want using the UI. We have a dynamic query engine that transforms UI inputs into a query.\nBecause of the flexibility and how much data we process, keeping integrations up, transforming data accurately, reporting accurately and performantly is a huge technical challenge.\nPlease email me at bugra @ hockeystack.com if you want to take a crack at some of these problems.\nWorth noting that we are fully in-person in a beautiful office near Oracle Park in SF!\nreply"
    },
    {
        "hnuser": "continua",
        "date": "2024-07-01T15:20:14",
        "comment": "Continua AI | ML and Systems Engineers | NYC, SF Bay Area, Seattle | http://continua.ai\nContinua was founded in April 2023 by a Distinguished Engineer from Google Research to give everyone in the world an agent that uses their real-time context and personal memory to deliver actionable and timely assistance. Our MVP is currently in limited alpha testing, and we’re immensely excited by the feedback we’re getting from early users - they’re finding that the Continua agent helps them in all manner of surprisingly useful ways.\nThis is an opportunity to be a part of setting the product and technical direction of this early stage company! ML engineers at Continua work on new approaches for knowledge representation, multimodality, and personalization under computational resource constraints. Systems engineers at Continua work on a wide variety of secure and reliable backend services and data pipelines to power our products.\nWe’re backed by tier-1 VCs, and we’ve already assembled a team of seven engineers with backgrounds at Google, Slack, CourseHero, Stash, and Amazon. We have a limited number of additional spots available on the team for engineers who are excited about building innovative products that leverage the latest advances in ML, including Transformers / Mamba, RLHF, LoRA/QLoRA, at-edge (on-device) training and inference, privacy-first ML, and more. If that sounds like you, we would love to hear from you.\nIf you are passionate about building innovative new products, and you’re eager to work in a dynamic startup environment, we would love to hear from you. Please apply via https://jobs.ashbyhq.com/continua/, and let's embark on this exciting journey together!\nreply"
    },
    {
        "hnuser": "iskeletorr",
        "date": "2024-07-01T16:32:18",
        "comment": "hi. since https://www.continua.ai/careers link is not opening, you should change the link with https://jobs.ashbyhq.com/continua/\nreply"
    },
    {
        "hnuser": "0x6164616d",
        "date": "2024-07-01T15:30:10",
        "comment": "Error \"page not found\" on careers link!\nreply"
    },
    {
        "hnuser": "wizerno",
        "date": "2024-07-01T16:09:14",
        "comment": "I believe it should be https://jobs.ashbyhq.com/continua\nreply"
    },
    {
        "hnuser": "resiros",
        "date": "2024-07-02T06:56:17",
        "comment": "Agenta | Hybrid (Berlin) | Full Time\nAgenta is an open-source LLM developer platform that provides all the necessary tools for rapidly building reliable LLM applications. Features include prompt management, evaluation, human feedback, and observability. Find out more about us at https://github.com/agenta-ai/agenta\nOur tech stack includes Python, FastAPI, MongoDB, Typescript, ReactJS, and NextJS.\nWe are hiring:\nFounding Product Engineer - Frontend: Ideally, you have previously worked in early-stage startups, can manage features from design to production, and have some background in LLMs.\nYou can find more details about this role here: https://agentaai.notion.site/Founding-Product-Engineer-Front...\nIf you're interested, please contact us directly at: careers@agenta.ai\nreply"
    },
    {
        "hnuser": "EthanSutin",
        "date": "2024-07-02T15:14:40",
        "comment": "Bee | Product Engineers, AI Engineers | San Francisco/Hybrid Remote Bee is a personal AI companion that enhances your daily life by understanding your needs and assisting with tasks.\nIntegrated with wearables, Bee learns from your interactions to provide personalized support, perform actions on your behalf, capture important moments, offer summaries, and help you stay organized.\nWith a novel mobile phone agent system, we give every user’s personal AI its own cloud phone to perform actions on their behalf.\nWe are backed by top-tier investors and founding team includes YC/TikTok/Twitter alums. Bee aims to help people feel more present in their daily lives by taking care of the details and allowing users to focus on what truly matters.\nWe're also expanding our team in San Francisco with hybrid roles, currently seeking: - Product Engineers - AI Engineers - Product Designer - Marketer\nEmail us! hi@bee.computer\nreply"
    },
    {
        "hnuser": "parav",
        "date": "2024-07-02T07:10:32",
        "comment": "Fondant | Generative 3D workflows | AI/ML Engineer (diffusion models) | Full time, REMOTE\nWe are hiring for diffusion model experts at Fondant. You will be a great fit if you can implement, customize and deploy SOTA open-source research in image, 3D and video diffusion models. Experience with finetuning and pretraining would be a huge plus.\nReach out at my username [at] fondant.design with a short blurb about yourself and link(s) to personal contribution(s) e.g., open-source code, cool demo of something you built etc.\nFondant is on a mission to make 3D more accessible. We are building a tool that harnesses the latest advancements in generative AI/ML to make new 3D workflows for modeling and rendering. Traditional 3D tools are often unapproachable (think Blender, 3DS Max). We are leveraging the lessons learnt from computer graphics + SOTA work on 3D reconstruction, NeRFs, gaussian splatting and image generation.\nWe have an early product + users + funding.\nreply"
    },
    {
        "hnuser": "cpcdoy",
        "date": "2024-07-03T08:26:29",
        "comment": "Abwab.ai | Multiple Roles | Remote | Full-time | https://abwab.ai/teaser\nAbwab.ai is democratizing financing for Small and Medium-sized Enterprises (SMEs) by disrupting the underwriting tech stack. We're reinventing credit rating for micro-financing, creating the infrastructure for AI-based lending in MENA and globally. Our team comprises tech enthusiasts from around the globe with experience from companies like Revolut, Bloomberg, Nvidia, Ubisoft, OakNorth, and more.\nWe're hiring for:\n- Senior Machine Learning Engineer\n- Product Manager\nApply at: https://abwab.ai/hiring or send me an email at: chady@abwab.ai\nreply"
    },
    {
        "hnuser": "michaelbilow",
        "date": "2024-07-05T18:19:02",
        "comment": "tvScientific | Senior ML Engineer (Zig) | Full Time | Remote (US) | https://www.tvscientific.com/ | $175-210k + Bonus | https://grnh.se/3e08afa98us\nWe're a Series A startup building a low-latency ML inference engine (and much more) as part of our Connected TV ad-buying platform. We're looking for Senior and Staff level Machine Learning Engineers with experience in Zig and Python to join our growing team!\nWhat you'll do:\n- Write production code in Zig, Python, and C\n- Design and implement new ML products to deliver clear performance from connected TV advertising\n- Serve as a technical lead and mentor to the team\nIdeal candidate:\n- Ability to write & review production-level code in Zig and Python\n- Excellent writing skills\n- Strong statistics and ML fundamentals\n- Desire to work at a fast-growing Series A startup–working under uncertainty, owning and scaling new products, and an experimental and iterative development process\nWhy join us?\n- An engineering culture optimized for async work and learning; remote-first, flexible, and humane.\n- Competitive salary and equity options.\n- An enormous diversity of high-leverage problems, from the CPU/GPU core level, through distributed systems, and up to the ML training stack and the experimentation around it. You can work at whatever level you think is interesting and leverages your skills the best.\nIf you're interested, apply on Greenhouse (https://grnh.se/3e08afa98us) or email me at mbilow[at]tvscientific[dot]com (I'm the Hiring Manager & Head of Data Science)\nreply"
    },
    {
        "hnuser": "uxhacker",
        "date": "2024-07-01T17:34:06",
        "comment": "Remote Generative AI Enthusiast for Luxury Fashion Content Creation\nWe’re a startup team of five, blending top talent from technology and luxury brands. Our mission: revolutionize content creation for luxury brands using generative AI. Our CTO, on his third successful startup journey, brings a wealth of experience from diverse industries.\nPosition:\n• Role: Generative AI Enthusiast • Location: Remote, with occasional travel for team meet-ups • Experience: Enthusiasm for generative AI and some experience with Python. Direct AI experience is a plus but not required.\nAbout Us:\n• Team: A blend of technology experts and creatives, including a member known for iconic fashion brand content. • Current Locations: Poland and Rome, but we’re open to anyone working from anywhere. • Industry: Luxury fashion content powered by AI. • Current Stage: Early-stage startup, crafting our identity and product.\nWhy Join Us:\n• Collaborate with industry leaders. • Be at the forefront of AI innovation in luxury fashion. • Enjoy a flexible remote work environment.\nHow to Apply: Send your resume and a brief cover letter to sjloydpage at gmail dot com\nreply"
    },
    {
        "hnuser": "ilaksh",
        "date": "2024-07-01T18:56:31",
        "comment": "I sent you an email, seeing a problem with that address:\n\"Your message wasn't delivered to [the email address you wrote] because the address couldn't be found, or is unable to receive mail.\"\nI can deliver my message via this GitHub gist: https://gist.githubusercontent.com/runvnc/5c33d935c2d96a7d24...\nreply"
    },
    {
        "hnuser": "ipl_stanford",
        "date": "2024-07-01T20:34:51",
        "comment": "Immigration Policy Lab, Stanford University | Full Stack Software Engineer | Remote | Full Time | https://immigrationlab.org/geomatch/\nStanford’s Immigration Policy Lab is seeking a mission-driven software engineer to join our GeoMatch project team. GeoMatch is a matching and recommendation tool that has helped case officers find new homes for thousands of refugees. To facilitate our growth, we are looking to improve our automation and data pipelines, add new modular and scalable features, and focus on application efficiency. The ideal candidate is passionate about leveraging technology for social good and ready to tackle challenges in a dynamic environment.\nApply here: https://careersearch.stanford.edu/jobs/full-stack-software-e...\nreply"
    },
    {
        "hnuser": "stirredo",
        "date": "2024-07-02T07:08:40",
        "comment": "This is remote (US only)\nreply"
    },
    {
        "hnuser": "RecruiterSRA",
        "date": "2024-07-02T13:23:20",
        "comment": "Security Risk Advisors | REMOTE (US) | DevOps Engineer III SRA’s mission is to level up every day to protect our clients and their customers. The DevOps Engineer III position will be part of Security Risk Advisors’ Software Development Team. We team with SRA’s Advisory Services, CyberSOC, and Research & Innovation teams to enhance our information security consulting practice in addition to building and deploying tools that serve our employees and our clients. We are rapidly improving our flagship product, VECTR (http://vectr.io/), an industry recognized Purple Team management and reporting platform. We’re looking for new team members to help us grow VECTR and build additional information security tools. This is an outstanding opportunity to work in a growing niche and interact with well-known client organizations.\n- 5+ years previous professional operations or DevOps experience working with cloud or virtualized installations of custom software. - Containerization Experience: Deep understanding of Docker and other containerization technology and orchestration. - Cloud Platforms: Demonstrated experience with cloud service providers such as AWS, GCP, or Azure, particularly their Kubernetes offerings such as Amazon EKS, Google Kubernetes Engine, and Azure Kubernetes Service. - Strong in CI/CD Pipelines: Knowledge of continuous integration and continuous deployment/delivery methodologies and tools like Jenkins, GitLab, CircleCI, and ArgoCD. - Programming and Scripting: Proficiency in a scripting language such as Python, Go, or Bash and a strong understanding of infrastructure as code (IaC) tools like Terraform, Ansible and Helm. - (Preferred) Proficient in Kubernetes: Must be able to deploy, configure, and manage Kubernetes clusters along with services and pods.\nVisit https://apply.workable.com/securityriskadvisors/j/83039E7215... to learn more and apply.\nreply"
    },
    {
        "hnuser": "wiggin77",
        "date": "2024-07-02T03:23:08",
        "comment": "Mattermost | Senior Software Design Engineer | US Remote | FT | $127,000 - $170,000\nMattermost provides secure, workflow-centric collaboration for technical and operational teams that need to meet nation-state-level security and trust requirements. We serve technology, public sector, national defense, and financial services industries with customers ranging from tech giants to the world’s largest banks, to the U.S. Department of Defense and governmental agencies around the world.\nWe are looking for a remote, US-based Senior SDE with a strong background in Go and SQL, who can work collaboratively on a fast-paced team, wants to own their projects end to end, and can find creative solutions to solve hard problems for our top customers.\nJoin our team: https://jobs.lever.co/mattermost/0ab4ed47-34ce-4d57-8af8-990...\nreply"
    },
    {
        "hnuser": "brendongeils",
        "date": "2024-07-01T21:29:21",
        "comment": "Athena Intelligence | Multiple Engineering Roles | New York City | ONSITE | Full-time\nAthena Intelligence is engineering the future of work. We're at the forefront of integrating artificial intelligence into enterprise operations, reshaping how humans and machines collaborate. Our flagship products include Olympus, an AI-native analytics platform, and Athena, an artificial employee designed to operate Olympus alongside enterprise teams.\nWe're looking for talented engineers to join our team:\n- Platform Engineer: Build and maintain the core infrastructure and services that power Olympus and Athena. Design scalable systems that enable seamless AI integration.\n- Product Engineer: Develop user and agent-facing applications within Olympus, including Reports, Sheets, Browse, Query, Notebooks, Spaces, and Flows. Create intuitive, AI-native interfaces.\n- Forward Deployed Engineer: Work directly with clients to implement Olympus and Athena, engineering solutions at the edge to address real-world challenges.\nOur tech stack includes: Backend: FastAPI, Yjs, Jupyter Server Frontend: TypeScript, React, Next.js, Yjs\nMore details on the roles: https://www.athenaintelligence.ai/company\nWe offer competitive salaries, equity, and comprehensive benefits. Our team previously deployed software at Palantir, IBM, Scale AI, and Yandex.\nAthena Intelligence is fully in-person, working 5 days a week in our NYC office. We believe in the power of face-to-face collaboration and maintaining a strong team culture.\nTo apply, please email your resume and a link to your Github to team@athenaintelligence.ai. Include the role you're applying for in the subject line.\nJoin us in shaping the future of work!\nreply"
    },
    {
        "hnuser": "EgregiousAI",
        "date": "2024-07-01T18:45:13",
        "comment": "Egregious AI | Fullstack Engineer | London | full-time | ONSITE | https://egregious.ai/\nEgregious is making the internet a better place by building AI to detect scammy and deceptive accounts on social media. We use maths, ML and tonnes of code to map & simulate the emergence and spread of harmful content.\nWe're the smallest big data company you've never heard of and we're looking for an exceptional, mission-oriented engineer to join us as employee #3 in our London office.\nYou'll need\n* Exceptional React, Vite, Javascript, CSS & Tailwinds skills\n* Solid understanding of asynchronous request handling and RESTful APIs\n* Proficiency with Git, Docker, Kubernetes and Azure/AWS/GCloud\n* Experience with PostgreSQL, MySQL, ElasticSearch, MongoDB or similar\n* Experience with Python is a plus\nUnfortunately we can't sponsor Visa holders. Candidates must be EU/UK passport holders and resident in the UK for the last 5 years. Please send your resume to: rupert at egregious dot ai.\nreply"
    },
    {
        "hnuser": "amauboussin",
        "date": "2024-07-01T21:20:42",
        "comment": "Surge AI (https://surgehq.ai) | Software Engineers (full-stack, backend / infra) and Strategic Project Lead (https://surgeai.notion.site/Strategic-Projects-Lead-Generati...) | Full-time | SF or Remote\nOur mission at Surge is to build the human infrastructure behind the next wave of AI and LLMs. We’re building a data platform that powers AI teams at OpenAI, Anthropic, Meta, Google, and more. Reinforcement Learning with Human Feedback is the critical technique behind the new generation of AI assistants, and that human feedback comes from us. Our product has been a game-changer for the top AI teams in the world. Here are some examples of our past work:\n- Creating the GSM8K dataset: https://www.surgehq.ai/blog/how-we-built-it-openais-gsm8k-da...\n- Collecting RLHF data for Anthropic's Claude: https://www.surgehq.ai/case-studies/anthropic-claude-surgeai...\nYou’d be joining a small, rapidly growing team of former engineering and ML leaders from Google, Meta, Twitter, and Airbnb. We work in small groups, ship quickly, and value autonomy and ownership. No previous AI experience is required, if you have the engineering skills you can learn what you need on the job.\nWe're looking for engineers with a few years of experience and you can work out of our office in SF or remotely. Please reach out to us at careers@surgehq.ai with a resume and 2-3 sentences describing your interest. Excited to hear from you!\nreply"
    },
    {
        "hnuser": "totallykvothe",
        "date": "2024-07-02T13:17:22",
        "comment": "OpenEye | ONSITE (Hybrid-schedule) in Liberty Lake, WA | Full Time\nOpenEye.net\nhttps://boards.greenhouse.io/openeye/jobs/7460211002\nOpenEye mainly deals in physical security solutions for businesses, including Point of Sale integration, cloud management of NVRs, sensors, and cameras, video analytics, etc.\nThe job posting is for our OWS (OpenEye Web Services) team and we are looking for an experienced developer (SE II). Java Spring on the backend. React + Typescript on the frontend.\nMost of our time is in the office, but we do have hybrid desk-sharing schedules available, and even if you aren't part of that, you can work from home 6 days per month, and exceptions are also flexible if you've got a one-off reason to need more in a month.\nreply"
    },
    {
        "hnuser": "Checkbook",
        "date": "2024-07-03T20:23:43",
        "comment": "Checkbook (https://checkbook.io/) | REMOTE - USA | Full-Time\nAs a leading provider of both legacy and modern payment options, Checkbook is uniquely positioned to enable businesses to access the speed, flexibility and cost savings of modern payment technologies, with the familiarity and simplicity of paper checks.\nSenior Full Stack Engineer: https://boards.greenhouse.io/checkbook/jobs/4023718007\nreply"
    },
    {
        "hnuser": "robz75",
        "date": "2024-07-02T03:28:21",
        "comment": "Evaboot | 1st engineer Python Django Backend | Full-Time | REMOTE | https://evaboot.com\nHi, we are 2 co-founders and we bootstrapped to 2M€ ARR in 2.5 years.\nEvaboot help sales teams create prospecting databases from LinkedIn.\nGoals: • Refactoring the existing Python-Django backend codebase. • New features development after refactoring period.\nRequirements: • Serious experience in Python, Django, Celery. • You have refactored a lot of spaghetti code before (and not just your own).\nBonus Points: • Experience with Heroku • Django REST framework • Scraping projects\nDetails, context and application right here:\nhttps://twilight-barnacle-bc7.notion.site/The-worst-Python-D...\nDon't be shy and don't hesitate to ask questions :)\nreply"
    },
    {
        "hnuser": "kgritesh",
        "date": "2024-07-04T10:24:39",
        "comment": "I actually enjoy refactoring messy code ->and have worked and improved multiple code bases in my time. However, I don't like recording videos. Any other alternative to apply.\nreply"
    },
    {
        "hnuser": "robz75",
        "date": "2024-07-04T10:38:43",
        "comment": "Thanks for your feedback, I can understand that it's not enoyable to record a video.\nBut for now we will keep these steps and this process since it's important for our recruitment process.\nreply"
    },
    {
        "hnuser": "benhamner",
        "date": "2024-07-01T16:09:39",
        "comment": "Sumble | sumble.com | Data/Backend/Full-stack Engineering + first GTM | Remote-only North-America timezones\nSumble's applying language models (both small and large) to build high-quality datasets. Near-term our focus is company-related data that we integrate with customer's Salesforce data to make go-to-market operations more efficient. Long-term we want to become the first place you go to find high-quality data that lives outside your organization.\nCurrently a team of 7 engineers, including Kaggle/Google/Primer/Stack Overflow/Meta alumni.\nOur tech stack includes Python, FastAPI, React/Typescript, GCP (postgres + alloydb + cloud run), regular expressions, and Pytorch/Gemma/Mistral.\nChallenges we face include:\n- Transforming noisy datasets + noisy models into high quality data products\n- Making expensive analytics computations run efficiently\n- Managing the complexity of an increasing number of data sources, models, and operations on top of these\nIf this excites you, get in touch with us by emailing me at ben at sumble.\nreply"
    },
    {
        "hnuser": "HeyTomesei",
        "date": "2024-07-04T13:19:35",
        "comment": "Hey Ben - the URL directs to https://sumble.com/orgs and requires creating an account to continue - is there another way to access your website?\nAlso, do you have links to the job posts?\nThanks!\nreply"
    },
    {
        "hnuser": "stirredo",
        "date": "2024-07-02T06:47:07",
        "comment": "Do you accept people from non-ivy league, non-FAANG backgrounds?\nreply"
    },
    {
        "hnuser": "HeyTomesei",
        "date": "2024-07-04T13:04:02",
        "comment": "Based on their LinkedIn profiles (I found 6, 5 of which are Engineers):\n- Nobody went to an Ivy League school.\n- Ben and Anthony only joined Google by way of acquisition; they co-founded Kaggle. Otherwise, one Engineer came from F.\nreply"
    },
    {
        "hnuser": "Recruiter_Joe",
        "date": "2024-07-01T22:49:00",
        "comment": "Qventus | REMOTE (USA, LATAM, INDIA) | Engineering / Product | www.qventus.com\nQventus provides a real-time decision-making platform for hospital operations. Our mission is to simplify how healthcare operates so that hospitals can focus on delivering the best possible care to patients. We use artificial intelligence and machine learning to create products and solutions that help nurses, doctors, and hospital staff anticipate issues and make operational decisions proactively. We work with leading public, academic, and community hospitals across the United States.\nWe are actively hiring for the following positions:\n*Remote US:\n- Sr. Data Engineer - GenAI Apps\n- Sr. Data Platform Engineer\n- Chief of Staff, AI Operational Assistant Innovation\n- Senior Product Manager, Inpatient Solution\n- Client Success Partner\n*INDIA:\n- Lead Analytics Engineer\n- Senior Data Engineer\n- Technical Tooling Lead\n- QA Manager\n*Remote LATAM:\n- Data Engineer ll\n*To see a full list of openings and to apply, follow our Join Us page: https://jobs.ashbyhq.com/qventus?utm_source=DQpNjMYvxb\nreply"
    },
    {
        "hnuser": "carol_l",
        "date": "2024-07-03T16:37:17",
        "comment": "Hello Joe,\nI applied for a Data Engineer role at Qventus and got rejected prior getting any screening.\nI was wondering if you could provide me any feedback on my resume and past experience, so that I can either update my resume or skillset.\nThank you\nreply"
    },
    {
        "hnuser": "douglas_fugazi",
        "date": "2024-07-02T15:50:52",
        "comment": "I am based in LATAM and I would like to know if there are any remote QA roles available for someone in LATAM. I have experience working as a QA Automation Engineer and I would like to apply for such a role. Please take a look at my profile: https://www.douglasfugazi.co\nreply"
    },
    {
        "hnuser": "rephus",
        "date": "2024-07-03T08:02:51",
        "comment": "Lightdash | Senior Full Stack Engineer | REMOTE (Europe-based) | full-time | https://www.lightdash.com/ | £60K – £110K +options\nWe are Lightdash, an open source BI and analytics dashboard. We are actively hiring for senior full-stack engineers who are fluent in Typescript+React+Node+SQL. We are a remote-first company, with our team members currently distributed all over Europe.\nTo apply, and for the full details: https://jobs.ashbyhq.com/lightdash/9efa292a-cc34-4388-90a2-2...\nreply"
    }
]